---------------------------------------
----- Ukrainian descriptions -----
---------------------------------------

-- Last Sync with English version: 25.10.2023

-- FORMAT: Item ID | Name| Description
-- '#' = starts new line of text

-- Special character markup:
-- ↑ = Up Arrow  |  ↓ = Down Arrow  |  !!! = Warning
local languageCode = "uk_ua"

local repCollectibles={
	[2] = {"2", "Внутрiшнє Око", "Потрiйний пострiл#↓ {{Tears}} -49% Скорострільність знижено"},
	[5] = {"5", "Моє Вiдображення", "Дає сльозам ефект бумеранга#↑ {{Damage}} +1.5 Шкоду збільшено#↑ {{Range}} +1.5 Дальнiсть збiльшено#↑ {{Range}} +100% додатково Дальнiсть збiльшено#↑ {{Shotspeed}} +60% Швидкість Стрільби збільшено#↓ {{Luck}} -1 Удачу зменшено"}, -- My Reflection
	[6] = {"6", "Номер Один", "↑ {{Tears}} +1.5 Темп Стрiльби збільшено#↓ {{Range}} -1.5 Дальнiсть зменшено#↓ {{Range}} -20% додатково Дальнiсть зменшено"}, -- Number One
	[12] = {"12", "Чарівний гриб", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Повне здоров'я#↑ {{Damage}} +0.3  Шкоду збільшено#↑ {{Damage}} +50%  Множник шкоди#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Speed}} +0.3 Швидкість збільшено#Розмір збільшено"}, -- Magic Mushroom
	[13] = {"13", "Вірус", "{{Poison}} Отруйний дотик#↑ {{Speed}} +0.2 Швидкість збільшено"}, -- The Virus
	[14] = {"14", "Гнів Роїда", "↑ {{Speed}} +0.3 Швидкість збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено"}, -- Roid Rage
	[18] = {"18", "Долар", "{{Coin}} +100 монет"}, -- A Dollar
	[22] = {"22", "Обід", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Lunch
	[23] = {"23", "Вечеря", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Dinner
	[24] = {"24", "Десерт", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Dessert
	[25] = {"25", "Сніданок", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Breakfast
	[26] = {"26", "Гниле м'ясо", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Rotten Meat
	[29] = {"29", "Матусині трусики", "↑ {{Range}} +1.5 Дальнiсть збільшено#Створює 3-6 Синіх Мух"}, -- Mom's Underwear
	[30] = {"30", "Матусині каблуки", "↑ {{Range}} +1.5 Дальнiсть збільшено#Наносить 12 контактної шкоди ворогам"}, -- Mom's Heels
	[31] = {"31", "Матусина помада", "↑ {{Range}} +2.25 Дальнiсть збільшено#{{Heart}} Створює 1 випадкове серце"}, -- Mom's Lipstick
	[37] = {"37", "Містер Бум", "Кидає велику бомбу під гравцем, яка наносить 185 шкоди"}, -- Mr. Boom
	[40] = {"40", "Камікадзе!", "Спричинює великий вибух на місці гравця#Наносить 185 шкоди"}, -- Kamikaze!
	[41] = {"41", "Матусина прокладка", "{{Fear}} Лякає всіх ворогів у поточній кімнаті на 5 секунд#Створює синю муху"}, -- Mom's Pad
	[42] = {"42", "Гнила Голова Боба", "{{Poison}} Метальна отруйна бомба#Наносить 185 + вашу шкоду#Створює отруйну хмарку"}, -- Bob's Rotten Head
	[45] = {"45", "Смачне Серце", "{{Heart}} Відновлює 1 Червоне серце#Також відновлює половину серця іншим гравцям"}, -- Yum Heart
	[46] = {"46", "Щаслива ніжка", "↑ {{Luck}} +1 Удачу збільшено#Збільшує шанс перемоги в азартних іграх#Збільшує шанс на нагороду за зачистку кімнати#Перетворює деякі погані пігулки в хороші"}, -- Lucky Foot
	[52] = {"52", "Доктор Фетус", "{{Bomb}} Стрільба бомбами#{{Damage}} Кожна бомба наносить 10x вашої шкоди#Якщо це значення більше 60 шкоди, натомість наносить 5x вашої шкоди + 30#↓ {{Tears}} -60% Скорострiльнiсть знижено"}, --Dr. Fetus
	[53] = {"53", "Магнето", "Притягує розхідники до персонажа#Дистанційно відкриває скрині, ігноруючи шкоду від шипастих скринь"}, -- Magneto
	[55] = {"55", "Матусине око", "50% шанс стріляти слізьми назад#{{Luck}} 100% шанс з Удачею 5"}, -- Mom's Eye
	[59] = {"59", "Книга Беліала", "<Item not obtainable>"}, -- The Book of Belial (Judas's Birthright Version)
	[62] = {"62", "Чарівність Вампіра", "↑ {{Damage}} +0.3  Шкоду збільшено#{{HalfHeart}} Відновлює половину червоного серця за кожного 13-го вбитого ворога"}, -- Charm of the Vampire
	[64] = {"64", "Знижки Steam", "{{Shop}} -50% знижка на предмети в магазині#Знижка збільшується, коли ви отримуєте цей артефакт декілька разів"}, -- Steam Sale
	[67] = {"67", "Сестра Меггі", "Компаньйон, що стріляє слізьми#Наносить 6 шкоди за сльозу"}, -- Sister Maggy
	[69] = {"69", "Шоколадне молоко", "{{Chargeable}} Заряджувані сльози#↑ {{Damage}} Шкода зростає відповідно до заряду, аж до 400%"}, -- Chocolate Milk
	[70] = {"70", "Гормони Росту", "↑ {{Damage}} +1  Шкоду збільшено#↑ {{Speed}} +0.2 Швидкість збільшено"}, -- Growth Hormones
	[71] = {"71", "Грибочок", "↑ {{Speed}} +0.3 Швидкість збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ Розмір зменшено"}, -- Mini Mush
	[72] = {"72", "Вервиця", "{{SoulHeart}} +3 Серця Душ#↑ {{Tears}} +0.5 Темп Стрiльби збільшено#{{Collectible33}} Біблію додано до пулу предметів всіх кімнат"}, -- Rosary
	[77] = {"77", "Мій маленький єдиноріг", "{{Timer}} На 6 секунд:#Невразливість#↑ {{Speed}} +0.28 Швидкість збільшено#Персонаж наносить 40 контактної шкоди за секунду"}, -- My Little Unicorn
	[78] = {"78", "Книга Одкровень", "{{SoulHeart}} +1 Серце Душі#При використанні, боса цього поверху буде замінено на Вершника#{{AngelDevilChance}} Поки тримаєте, шанс на кімнати Диявола чи Янгола збільшено на +17.5%"}, -- Book of Revelations
	[79] = {"79", "Позначка", "↑ {{Damage}} +1 Шкоду збільшено#↑ {{Speed}} +0.2 Швидкість збільшено#{{BlackHeart}} +1 Чорне Серце"}, -- The Mark
	[80] = {"80", "Договір", "↑ {{Damage}} +0.5  Шкоду збільшено#↑ {{Tears}} +0.7 Темп Стрiльби збільшено#{{BlackHeart}} +2 Чорних Серця"}, -- The Pact
	[83] = {"83", "Цвях", "{{HalfBlackHeart}} + Половинка Чорного Серця#↑ {{Damage}} +2  Шкоду збільшено#↓ {{Speed}} -0.18 Швидкість зменшено#Наносить 40 контактної шкоди за секунду#Можна ламати камені, пройшовши по них"}, -- The Nail
	[84] = {"84", "Треба йти глибше!", "Створює люк на наступний поверх#{{LadderRoom}} Створює вхід до криївки, якщо використано на декоративних елементах підлоги (трава, малі камінці, папірці, розсипані коштовності, інше.)"}, --We Need To Go Deeper!
	[87] = {"87", "Ріжки Локі", "25% шанс вистрелити  в 4 напрямках#{{Luck}} 100% шанс з Удачею 15"}, -- Loki's Horns
	[91] = {"91", "Шолом Спелеолога", "Розкриває типи кімнат в радіусі 2 суміжних кімнат#{{SecretRoom}} Може також виявити Секретні та Суперсекретні кімнати#Блокує снаряди, що падають згори"}, -- Spelunker Hat
	[98] = {"98", "Реліквія", "{{SoulHeart}} Створює 1 Серце Душі кожні 7-8 кімнат"}, -- The Relic
	[101] = {"101", "Німб", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↑ {{Damage}} +0.3 Шкоду збільшено#↑ {{Tears}} +0.2 Темп Стрiльби збільшено#↑ {{Range}} +0.38 Дальнiсть збільшено#↑ {{Speed}} +0.3 Швидкість збільшено#"}, -- The Halo
	[106] = {"106", "Містер Мега", "{{Bomb}} +5 Бомб#↑ Шкода від бомб x1.85"}, -- Mr. Mega
	[110] = {"110", "Матусині Лінзи", "20% шанс паралізувати ворога сльозою#{{Luck}} 50% шанс при Удачі 20#↑ {{Range}} +0.38 Дальнiсть збільшено"}, -- Mom's Contacts
	[114] = {"114", "Матусин ніж", "Персонаж стріляє ножами замість сліз#Ніж наносить 2x шкоди персонажа в ближньому бою та 6x шкоди при 1/3 заряду#Решта заряду впливає лише на дальність польоту ножа#Шкода зменшується до 2x, коли ніж повертається до персонажа"}, -- Mom's Knife
	[115] = {"115", "Дошка Уіджа", "↑ {{Tears}} +0.5 Темп Стрільби збільшено#Спектральні сльози"}, -- Ouija Board
	[118] = {"118", "Сірка", "{{Chargeable}} Заряджуваний#Персонаж стріляє кривавим лазером, що наносить постійну шкоду#↓ {{Tears}} -67% Скорострiльнiсть зменшено"}, -- Brimstone
	[121] = {"121", "Дивний Гриб (Великий)", "↑ {{Heart}} +1 Контейнер з червоним серцем#↑ {{Damage}} +1  Шкоду   збільшено#↑ {{Range}} +0.38 Дальнiсть збільшено#↓ {{Speed}} -0.2 Швидкість зменшено"}, -- Odd Mushroom (Large)
	[123] = {"123", "Книга Монстрів", "Створює випадкового компаньйона#Він живе до кінця поточного поверху"}, -- Monster Manual
	[126] = {"126", "Лезо бритви", "↑ {{Damage}} +1.2 Шкоду збільшено для поточної кімнати#{{Warning}} Наносить 1 серце шкоди персонажу#Після першого використання в кімнаті, наносить 0.5 серця шкоди#Червоні серця є пріоритетними"}, -- Razor Blade
	[129] = {"129", "Відро Смальцю", "↑ {{Heart}} +2 Контейнери з червоними серцями#↓ {{Speed}} -0.2 Швидкість зменшено"}, -- Bucket of Lard
	[135] = {"135", "Крапельниця", "Переносний приймач крові#Половинка серця = 1-2 монетки#{{HardMode}} 1 монетка у режимі Hard#{{Player14}} 0-1 монети для Хранителя"}, -- IV Bag
	[138] = {"138", "Стигма", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↑ {{Damage}} +0.3 Шкоду збільшено#"}, -- Stigmata
	[139] = {"139", "Матусин Гаманець", "{{Trinket}} Тепер Ви можете тримати 2 брелки#{{Trinket}} Створює 1 випадковий брелок"}, -- Mom's Purse
	[140] = {"140", "Прокляття Боба", "{{Poison}} Отруйні бомби#Бомби залишають отруйну хмарку#Дає імунітет до отрути#{{Bomb}} +5 бомб"}, -- Bob's Curse
	[142] = {"142", "Скапулярій", "{{SoulHeart}} Якщо у Вас залишилась всього половинка серця, дає 1 Серце Душі (один раз на кімнату)#!!! Не спрацьовує при пожертвах"}, --Scapular
	[147] = {"147", "Вищерблене Кайло", "Ламає камені та може наносити шкоду ворогам у ближньому бою#Кайло розряджається від кожного удару ним по об'єкту#Заряд поповнюється при переході між поверхами#В оригіналі зветься Notched Axe, що є великодкою до гри Minecraft"}, -- Notched Axe
	[148] = {"148", "Зараження", "Створює 2-6 синіх мух, коли Вам завдають шкоди"}, -- Infestation
	[149] = {"149", "Іпекак", "{{Poison}} Вибухові отруйні сльози#↑ {{Damage}} +40 Шкоду збільшено#↓ {{Shotspeed}} -0.2 Швидкість Стрільби зменшено#↓ {{Tears}} -67% Скорострiльнiсть зменшено#↓ {{Range}} -20% Дальнiсть зменшено"}, -- Ipecac
	[152] = {"152", "Технологія 2", "Замінює праве око персонажа на постійний лазер#{{Damage}} Лазер наносить 13% від Вашої шкоди#↓ {{Tears}} -33% Скорострiльнiсть зменшено"}, -- Technology 2
	[153] = {"153", "Павук-Мутант", "Квадропостріл!#↓ {{Tears}} -58% Скорострiльнiсть зменшено"}, -- Mutant Spider
	[155] = {"155", "Споглядач", "Літає по кімнаті#Наносить 17.1 контактної шкоди за секунду#↑ {{Damage}} Сльози з лівого ока Ісаака наносять на 34% більше шкоди"}, -- The Peeper
	[158] = {"158", "Кришталева Куля", "Відкриває повну карту поверху#Створює щось зі списку: #{{SoulHeart}} Серце Душі#{{Card}} Випадкова карта#{{Rune}} Випадкова руна#Поки тримаєте:#{{PlanetariumChance}} +15% шанс на Планетарій#100%, якщо {{TreasureRoom}} Скарбниця на попередньому поверсі була пропущена"}, -- Crystal Ball
	[161] = {"161", "Анкх", "{{Player4}} Відродження за ??? (Синій Малюк) у випадку смерті#{{Player25}} Гнилий ??? відродиться собою ж"},
	[169] =	{"169", "Поліфем", "↑ {{Damage}} +100%  Шкоду збільшено#↑ {{Damage}} +4 додатково Шкоду збільшено#↓ {{Tears}} -58% Скорострiльнiсть зменшено#Після зіткнення з ворогом, сльоза продовжить політ з рештою шкоди"}, --Polyphemus
	[171] = {"171", "Павуча Дупка", "{{Slow}} Сповільнює ворогів на 4 секунди#Наносить 10 Шкоди усім ворогам#Створює 1 синього павука за кожного вбитого ним ворога"}, -- Spider Butt
	[172] = {"172", "Жертовний Клинок", "Орбітальний ніж#Блокує ворожі постріли#Наносить 112.5 Шкоди за секунду"}, -- Sacrificial Dagger
	[176] = {"176", "Стовбурові Клітини", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↑ {{Shotspeed}} +0.16 Швидкість стрільби збільшено"}, -- Stem Cells
	[178] = {"178", "Свята Вода", "{{Throwable}} {{ColorOrange}}Метальна{{CR}}#Запускає себе в напрямку стрільби Ісаака#Розбивається та наносить 7 Шкоди, коли торкається до ворога#Залишає калюжу рідини, що наносить шкоду і паралізує ворогів"}, -- Holy Water
	[180] = {"180", "Чорна квасоля", "Персонаж пукає декілька разів та залишає хмарки отруйного газу, коли до нього торкаються"}, -- The Black Bean
	[182] = {"182", "Святе Серце", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Повне здоров'я#↑ {{Damage}} 230% + 1  Шкоду збільшено#↓ {{Tears}} -0.4 Темп Стрiльби зменшено#↓ {{Shotspeed}} -0.25 Швидкість стрільби зменшено#Самонавідні сльози"}, -- Sacred Heart
	[184] = {"184", "Святий Грааль", "Політ#↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Holy Grail
	[186] = {"186", "Криваві права", "Наносить 40 шкоди всім ворогам#{{Warning}} Наносить 1 серце шкоди персонажу#Після першого використання в кімнаті, наносить 0.5 серця шкоди#Червоні серця є пріоритетними"},
	[188] = {"188", "Авель", "Компаньйон, який віддзеркалює ваші рухи#Стріляє назустріч гравцю#Наносить 3.5 Шкоди за постріл#{{Player2}} Наносить 7.5 Шкоди за Каїна"}, -- Abel
	[189] = {"189", "Суперфанат SMB!", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Повне здоров'я#↑ {{Damage}} +0.3 Шкоду збільшено#↑ {{Tears}} +0.2 Темп Стрiльби збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Speed}} +0.2 Швидкість збільшено"}, -- SMB Super Fan
	[192] = {"192", "Телепатія для Чайників", "Для поточної кімнати: #↑ {{Range}} +3 Дальнiсть збільшено#Самонавідні сльози"}, -- Telepathy for Dummies
	[193] = {"193", "М'ЯСО!", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↑ {{Damage}} +0.3 Шкоду збільшено"}, -- MEAT!
	[194] = {"194", "Чарівна Куля 8", "↑ {{Shotspeed}} +0.16 Швидкість стрільби збільшено#{{Card}} +1 карта#{{PlanetariumChance}} Шанс на Планетарій +15%"}, -- Magic 8 Ball
	[197] = {"197", "Йсусів Сік", "↑ {{Damage}} +0.5 Шкоду збільшено#↑ {{Range}} +0.38 Дальнiсть збільшено"}, -- Jesus Juice
	[203] = {"203", "Скромний Згорток", "50% шанс створити подвійну версію розхідників"}, -- Humbling Bundle
	[205] = {"205", "Гострий Штекер", "{{Battery}} При використанні незарядженого активного предмета, дозаряджає його за серця#Знімає половинку серця за кожен заряд#Червоні серця в пріоритеті"}, -- Sharp Plug
	[206] = {"206", "Гільйотина", "↑ {{Damage}} +1 Шкоду збільшено#↑ {{Tears}} +0.5 Скорострiльнiсть збільшено#Ваша голова стає невразливим орбіталем і наносить 65 контактної шкоди за секунду#Ви продовжите стріляти з голови"}, -- Guillotine
	[211] = {"211", "Павучок", "Створює 3-5 синіх павуків при отриманні шкоди"}, -- Spiderbaby
	[214] = {"214", "Анемія", "↑ {{Range}} +1.5 Дальнiсть збільшено#Отримавши шкоду, Ви залишаєте слід з рідини, яка завдає шкоди ворогам"}, -- Anemic
	[218] = {"218", "Плацента", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#{{HalfHeart}} 50% шанс відновити половинку серця кожної хвилини"}, -- Placenta
	[222] =	{"222", "Антигравітація", "Утримання кнопок стрільби змушує сльози зависнути в повітрі#Коли відпустите кнопки, сльози полетять в напрямку, в якому їх було випущено#↑ {{Tears}} +1 Скорострiльнiсть збільшено"}, -- Anti-Gravity
	[223] = {"223", "Піроманіяк", "Вибухи відновлюють по 0.5 червоного серця персонажу, замість того, щоб наносити йому шкоду#{{Bomb}} +5 бомб"}, -- Pyromaniac
	[224] = {"224", "Тіло Крікета", "Сльози розлітаються на 4 частини при ударі#Кожна частинка наносить половину від шкоди сльози#↑ {{Tears}} +0.5 Скорострiльнiсть збільшено#↓ {{Range}} -20% Дальнiсть зменшено"}, -- Cricket's Body
	[226] = {"226", "Чорний лотос", "↑ {{Heart}} +1 Контейнер червоних сердець#{{Heart}} Відновлює 1 червоне серце#{{SoulHeart}} +1 серце Душі#{{BlackHeart}} +1 Чорне серце"}, -- Black Lotus
	[228] = {"228", "Матусині Парфуми", "{{Fear}} 15% шанс випустити сльозу Страху#↑ {{Tears}} +0.5 Скорострiльнiсть збільшено"}, -- Mom's Perfume
	[229] =	{"229", "Легеня Монстро", "{{Chargeable}} Сльози заряджаються і випускаються ніби з дробовика#↓ {{Tears}} -77% Скорострiльнiсть зменшено"}, --Monstro's Lung
	[230] = {"230", "Абаддон", "↑ {{Damage}} +1.5 Шкоду збільшено#↑ {{Speed}} +0.2 Швидкість збільшено#{{Fear}} Сльози страху#Перетворює всі {{Heart}} Контейнери Червоних сердець {{BlackHeart}} в Чорні серця#{{BlackHeart}} +2 Чорні серця"}, -- Abaddon
	[232] = {"232", "Секундомір", "{{Slow}} Постійний ефект сповільнення для ворогів#↑ {{Speed}} +0.3 Швидкість збільшено"}, -- Stop Watch
	[233] = {"233", "Крихітна Планета", "Сльози кружляють навколо Вас#↑ {{Range}} +6.5 Дальнiсть збільшено#Спектральні сльози"}, -- Tiny Planet
	[240] = {"240", "Експериментальне лікування", "↑ Збільшує 4 випадкові характеристики#↓ Зменшує 2 випадкові характеристики"}, -- Experimental Treatment
	[245] = {"245", "20/20", "Подвоює всі Ваші постріли#↓ {{Damage}} -20% Шкоду зменшено"}, -- 20/20
	[248] = {"248", "Вуликовий Розум", "Сині павуки та мухи наносять подвійну шкоду#Компаньйони на основі мух та павуків стають сильнішими"}, -- Hive Mind
	[253] = {"253", "Чарівний Струп", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↑ {{Luck}} +1 Удачу збільшено"}, -- Magic Scab
	[254] = {"254", "Згусток Крові", "!!! Застосовується лише для ЛІВОГО ока#↑ {{Damage}} +1 Шкоду збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено"}, -- Blood Clot
	[256] = {"256", "Гарячі Бомби", "{{Burning}} Підпалені бомби#Вогонь більше не завдає Вам шкоди#Бомби наносять контактну шкоду#{{Bomb}} +5 Бомб"}, -- Hot Bombs
	[261] = {"261", "Проптоз", "↑ {{Damage}} +0.5 Шкоду збільшено#↓ Шкода від сліз зменшується за час їх польоту#300% шкоди впритул"}, -- Proptosis
	[262] = {"262", "Втрачена сторінка 2", "{{BlackHeart}} +1 Чорне Серце#Коли у Вас залишається 1 серце, наносить шкоду всім ворогам в кімнаті#{{Collectible35}} Ефект від Чорних сердець і Некрономікона наносять подвійну шкоду"}, -- Missing Page 2
	[263] = {"263", "Чиста руна", "{{Rune}} Копіює ефекти руни чи каменя душі, які ви тримаєте в руках#Створює одну випадкову руну"}, -- Clear Rune (REPENTANCE ITEM)
	[264] = {"264", "Розумна мушка", "Орбіталь#Атакує ворогів, коли персонажу завдають шкоди#Наносить 6.5 шкоди за секунду"}, -- Smart Fly
	[273] = {"273", "Мозок Боба", "{{Throwable}} {{ColorOrange}}Метальна{{CR}} бомба#Вибух наносить 100 шкоди#Вибух ігнорує броню"}, -- Bob's Brain
	[274] = {"274", "Найкращий друг", "Коли вам завдають шкоди, створює орбітального компаньйона середнього радіуса на кімнату#Орбіталь наносить 150 шкоди за секунду"}, -- Best Bud
	[275] = {"275", "Сірчаний крихітка", "{{Collectible118}} Компаньйон, що стріляє заряджуваним лазером Сірки#Постріл наносить 3 шкоди за ігровий тік, загалом 24 шкоди"}, -- Lil Brimstone
	[276] = {"276", "Серце Ісаака", "Тіло персонажа стає невразливим#!!! Коли Серцю завдають шкоди, вона зараховується Вам#Компаньйон заряджає атаку, поки ви стріляєте. При пострілі, Серце також відштовхує ворогів та їх снаряди"}, -- Isaac's Heart
	[278] = {"278", "Темний жебрак", "{{Heart}} Збирає червоні серця з підлоги#За кожні 1.5 серця дає Чорне серце, карту, пігулку, руну чи павука"}, -- Dark Bum
	[280] = {"280", "Сісся Довгоногий", "Випадково створює синіх павуків у кімнатах з ворогами#{{Charm}} Причаровує ворогів при дотику до них"}, -- Sissy Longlegs
	[283] = {"283", "D100", "Реролить всі п'єдестали, характеристики, розхідники та всі підібрані пасивні артефакти#Дублікує 1 випадковий розхідник в кімнаті#Перезапускає поточну кімнату, відновлює та реролить ворогів#Реролить камені в кімнаті"}, -- D100
	[285] = {"285", "D10", "Реролить всіх ворогів у кімнаті, замінюючи на слабші версії#Наприклад, усі червоні мухи стануть чорними"}, -- D10
	[287] = {"287", "Книга Таїнств", "При використанні, підсвічує таємничі камені та камені з люком до криївки#Дає один з ефектів до кінця поверху: #{{Collectible54}} Карта скарбів#{{Collectible21}} Компас #{{Collectible246}} Синя карта#Дає ефекти, яких у вас ще немає#{{Collectible76}} Якщо всі ефекти вже активні, дає Рентгенівське бачення"}, -- Book of Secrets
	[288] = {"288", "Коробка з павуками", "Створює 4-8 синіх павуків"}, -- Box of Spiders
	[289] = {"289", "Червона свічка", "Кидає червоний вогонь#Вогонь зникне, коли завдасть шкоди ворогу, заблокує 5 пострілів або через 10 секунд"}, -- Red Candle
	[291] = {"291", "Злив!", "Перетворює усіх не-босів у купки лайна#Миттєво вбиває какашкових ворогів та босів#Гасить всі вогнища і наповнює кімнату водою#Перетворює клітинки з лавою на придатну для ходьби підлогу"}, -- Flush!
	[292] = {"292", "Сатанинська біблія", "{{BlackHeart}} +1 Чорне серце#{{DevilRoom}} При використанні перед боєм з босом, предмет Кімнати Боса буде Диявольською угодою#!!! Прийняття цієї угоди матиме ті ж наслідки, що і в Кімнаті Диявола"}, -- Satanic Bible
	[294] = {"294", "Масляний біб", "Відштовхує найближчих ворогів і снаряди#Вороги, яких штовхнуло на перешкоди, отримують 10 шкоди"}, -- Butter Bean
	[295] = {"295", "Чарівні пальчики", "Наносить усім ворогам у кімнаті x2 від шкоди гравця + 10#{{Coin}} Ціна: 1 монетка"}, -- Magic Fingers
	[296] = {"296", "Перетворювач", "Перетворює 1 серце Душі або Чорне серце на 1 Контейнер червоного серця"}, -- Converter
	--NOTE FOR LOCALIZERS: There is code to highlight the text of your current floor
	--For it to work, only use line breaks or semicolons to separate floor details, and use the same order as English
	[297] = {"297", "Скринька Пандори", "створює предмети залежно від вашого поверху:#B1: 2 {{SoulHeart}}; B2: 2 {{Bomb}} & 2 {{Key}}#C1: 1 {{BossRoom}} предмет; C2: B1+C1#D1: 4 {{SoulHeart}}; D2: 20 {{Coin}}#W1: 2 {{BossRoom}} предмети#W2: {{Collectible33}} Біблія#???/Void: Нічого#Sheol: 1 {{DevilRoom}} предмет + 1 {{BlackHeart}}#Cathe: 1 {{AngelRoom}} предмет + 1 {{EternalHeart}}#Dark Room: {{Collectible523}} Відкриває Коробку для перенесень; Chest: 1 {{Coin}}#Home: {{Collectible580}} Червоний ключ"}, -- Pandora's Box
	[300] = {"300", "Овен", "↑ {{Speed}} +0.25 Швидкість збільшено#Дотик до ворогів завдає їм шкоди#Рухаючись достатньо швидко, можна уникнути контактної шкоди"}, -- Aries
	[307] = {"307", "Козоріг", "↑ {{Heart}} +1 Контейнер з червоним серцем#↑ {{Damage}} +0.5 Шкоду збільшено#↑ {{Speed}} +0.1 Швидкість збільшено#↑ {{Range}} +0.75 Дальнiсть збільшено#↑ {{Tears}} +0.5 Скорострiльнiсть збільшено#+1 бомба, монетка і ключ"}, -- Capricorn
	[308] = {"308", "Водолій", "Ви залишаєте за собою мокрий слід#{{Damage}} Ця рідина наносить 66% Вашої шкоди за секунду#На рідину поширюються ефекти сліз"}, -- Aquarius
	[309] =	{"309", "Риби", "↑ {{Tears}} +0.5 Скорострiльнiсть збільшено#↑ {{Tearsize}} +0.12 Розмір сльози збільшено#Сльози відштовхують ворогів сильніше"}, --Pisces
	[310] =	{"310", "Туш Єви", "↑ {{Damage}} +100% Шкоду збільшено#↓ {{Tears}} -33% Темп Стрiльби зменшено#↓ {{Shotspeed}} -0.5 Швидкість Стрільби зменшено"},
	[311] = {"311", "Тінь Юди", "{{Player12}} При смерті, персонаж відроджується як Темний Юда#{{Damage}} Він має множник шкоди x2#{{Player24}} Гнилий Юда відродиться собою"}, --Judas' Shadow
	[314] = {"314", "Громові стегна", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↓ {{Speed}} -0.4 Швидкість знижено#Ви можете знищити камені, пройшовши по них"}, -- Thunder Thighs
	[315] = {"315", "Дивна принада", "Магнітні сльози#Притягує ворогів, розхідники та брелки#Предмети будуть тягнутися до місця падіння сльози"}, -- Strange Attractor
	[316] = {"316", "Прокляте око", "Заряджувана атака з 5 сліз#{{Warning}} Отримання шкоди при частково зарядженій атаці телепортує персонажа до випадкової кімнати#{{Collectible260}} Чорна Свічка прибирає ефект телепортації"}, -- Cursed Eye
	[319] = {"319", "Інше око Каїна", "Стріляє у випадковому напрямку, копіюючи ефекти сліз персонажа#{{Damage}} Наносить 75% шкоди персонажа"}, -- Cain's Other Eye
	[320] = {"320", "Єдиний друг ???", "Керована муха#Наносить 3.5 контактної шкоди за ігровий тік"}, -- ???'s Only Friend
	[323] = {"323", "Сльози Ісаака", "Випускає 8 сліз у всіх напрямках#Сльози успадковують ефекти сліз персонажа, +5 Шкоди#Перезаряджається при стрільбі"}, -- Isaac's Tears
	[326] = {"326", "Подих життя", "Утримуйте кнопку ВИКОРИСТАТИ, щоб розрядити предмет#Розряджений артефакт дає ефект невразливості#Промінь світла б'є ворогів, які торкнуться до Вас під час невразливості#Якщо ви заблокуєте шкоду в останню мить, персонаж вистрелить лазером Святої Сірки й отримає короткочасний щит#!!! Не тримайте задовго, адже почнете отримувати шкоду!"}, -- Breath of Life
	[328] = {"328", "Негатив", "↑ {{Damage}} +1 Шкоду збільшено#Якщо у вас менше 1 Червоного серця, завдає шкоди всім ворогам при отриманому ударі"}, -- The Negative
	[330] = {"330", "Соєве молоко", "↑ {{Tears}} 5.5x Скорострiльнiсть збільшено#↓ {{Damage}} -80% Шкоду зменшено#Сильно зменшує відштовхування"}, -- Soy Milk
	[331] = {"331", "Божество", "↑ {{Speed}} +0.5 Шкоду збільшено#↓ {{Tears}} -0.3 Темп Стрiльби зменшено#↓ {{Shotspeed}} -0.3 Швидкість Стрільби зменшено#Сльози отримують ауру, яка наносить 60 шкоди за секунду#Самонавідні сльози"}, -- Godhead
	[332] = {"332", "Ганчір'я Лазаря", "{{Player11}} При смерті, персонаж відроджується як Лазар(Воскреслий) і отримує його предмети#{{Player29}} Гнилий Лазар відродиться собою"},
	[336] = {"336", "Гнила цибуля", "Пронизуючі та спектральні сльози#↓ {{Range}} -1.5 Дальнiсть зменшено#↓ {{Shotspeed}} -0.4 Швидкість Стрільби зменшено#↑ {{Tearsize}} +50% Розмір сліз збільшено"}, -- Dead Onion
	[339] = {"339", "Безпечна шпилька", "↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Shotspeed}} +0.16 Швидкість Стрільби збільшено#{{BlackHeart}} +1 Чорне серце"}, -- Safety Pin
	[342] = {"342", "Синя шапочка", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#↑ {{Tears}} +0.7 Темп Стрiльби збільшено#↓ {{Shotspeed}} -16% Швидкість Стрільби зменшено"}, -- Blue Cap
	[344] = {"344", "Сірникова коробка", "{{BlackHeart}} +1 Чорне серце#Створює: #{{Bomb}} 2-3 Бомби#{{Trinket41}} Сірник"}, -- Match Book
	[345] = {"345", "Синтол", "↑ {{Damage}} +1 Шкоду збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено"}, -- Synthoil
	[346] = {"346", "Перекус", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- A Snack
	[350] = {"350", "Токсичний шок", "{{Poison}} Увійшовши в кімнату, Ви отруюєте всіх ворогів там#Імунітет до отруйних хмарок#Вбиті вороги залишають калюжі отруйною рідиною"}, -- Toxic Shock
	[352] = {"352", "Скляна гармата", "Стріляє однією великою пронизуючою спектральною сльозою ((Шкода x10) + 10)#!!! При отриманні шкоди:#↓ Ви додатково втратите 2 серця#↑ {{Range}} +1.5 Дальнiсть збільшено #Ви залишаєте кривавий слід#Додаткова шкода НЕ може вбити вас#Самопошкодження не враховується"}, -- Glass Cannon
	[354] = {"354", "Хрусткий Джек", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#{{Trinket}} Створює випадковий брелок на підлозі"}, -- Crack Jacks
	[355] = {"355", "Матусине намисто", "↑ {{Range}} +0.38 Дальнiсть збільшено#↑ {{Luck}} +1 Удачу збільшено#{{SoulHeart}} +1 серце Душі"}, -- Mom's Pearls
	[360] = {"360", "Інкуб", "Демонічний компаньйон, який копіює атаку персонажа#{{Damage}} Наносить 75% вашої шкоди#{{Player13}} 100% при грі за Ліліт"}, -- Incubus
	[365] = {"365", "Розгублена муха", "Рухається вздовж стін/перешкод у кімнаті#Наносить 56 контактної шкоди за секунду#Найближчі вороги будуть цілитись в муху"},
	[366] = {"366", "Розкидні бомби", "{{Bomb}} +5 бомб#При вибуху, ваші бомби розкидають ще 4-5 дрібних бомбочок"}, -- Scatter Bombs
	[367] = {"367", "Липкі бомби", "{{Bomb}} +5 бомб#Бомби персонажа прилипають до ворогів та залишають білу сповільнювальну рідину на підлозі#При вбивстві ворога бомбою, з'являються сині павуки"}, -- Sticky Bombs
	[368] =	{"368", "Епіфора", "↑ {{Tears}} Стрільба в одному напрямку поступово збільшує вашу скорострільність до 200%"}, -- Epiphora
	[369] = {"369", "Континуум", "↑ {{Range}} +3 Дальнiсть збільшено#Спектральні сльози#Сльози проходять крізь стіни і з'являються з протилежних стін"}, -- Continuum
	[370] = {"370", "Містер Лялька", "↑ {{Tears}} +0.7 Темп Стрiльби збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#{{Heart}} Створює 3 випадкові серця"}, -- Mr. Dolly
	[374] = {"374", "Святе світло", "10% шанс вистрелити  Святою сльозою, яка генерує Промінь Світла при влучанні#{{Luck}} 50% шанс при Удачі 9#{{Damage}} Промінь наносить x3 Вашої шкоди"}, -- Holy Light
	[375] = {"375", "Капелюх Господаря", "Імунітет до вибухів#25% шанс заблокувати ворожу сльозу#Захищає від снарядів, що падають зверху"}, -- Host Hat
	[376] = {"376", "Поповнення", "Магазин миттєво поповнює товари при купівлі#Нові товари коштують дорожче"}, -- Restock
	[380] = {"380", "Плати і грай", "{{Coin}} +5 монет#Тепер ви відкриваєте закриті двері та скрині монетами замість ключів"},
	[382] = {"382", "Дружній м'яч", "Можна зловити ворога, кинувши в нього м'ячем#При наступному використанні, спіймана істота з'явиться як Ваш компаньйон#Можна підняти кулю, ставши на неї. Це миттєво перезарядить предмет"}, -- Friendly Ball
	[384] = {"384", "Крихітка Гарді", "{{Chargeable}} Запускається і ковзає по кімнаті#Швидкість залежить від заряду#Наносить 5-25 контактної шкоди за удар, залежно від швидкості"}, -- Lil Gurdy
	[389] = {"389", "Мішечок для рун", "{{Rune}} Створює випадкову Руну або Камінь Душі кожні 7-8 кімнат"}, -- Rune Bag
	[391] = {"391", "Зрадник", "Вороги можуть отримати шкоду від атак своїх соратників і почати битися між собою"}, -- Betrayal
	[393] = {"393", "Зміїний поцілунок", "{{Poison}} 15% шанс вистрелити  отруйною сльозою#{{Luck}} Не залежить від Удачі#{{Poison}} Отруює ворогів при дотику#{{BlackHeart}} При смерті ворогів, отруєних дотиком, з 20% шансом може з'явитися Чорне серце"}, -- Serpent's Kiss
	[394] = {"394", "Мічений", "Всі ваші сльози автоматично спрямовуються в бік червоної мітки, яку контролює гравець#↑ {{Tears}} +0.7 Темп Стрiльби збільшено#↑ {{Range}} +3 Дальнiсть збільшено#Компаньйони також стріляють в бік мітки"}, -- Marked
	[395] = {"395", "Технологія X", "{{Chargeable}} Ви стріляєте заряджуваним лазерним кільцем, яке пролітає через всю кімнату#Шкода і розмір кільця залежить від заряду#100% шкоди при повному заряді"}, -- Tech X
	[397] = {"397", "Промінь тягача", "Ваші сльози летять строго вздовж променю, нікуди не відхиляючись, навіть якщо ви рухаєтесь#↑ {{Tears}} +1 Скорострiльнiсть збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Shotspeed}} +0.16 Швидкість Стрільби збільшено"},
	[399] = {"399", "Паща Порожнечі", "{{Chargeable}} Після 2.35 секунд безперервної стрільби, на голові персонажа з'явиться червоний хрест#{{Collectible118}} Відпустіть кнопки стрільби, щоб створити чорне лазерне кільце навколо персонажа"}, -- Maw of the Void
	[401] = {"401", "Вибухівчик", "25% шанс вистрелити  сльозою, що приклеюється до ворога#{{Luck}} Не залежить від Удачі#Сльози вибухають за декілька секунд і наносять Вашу шкоду + 60"}, -- Explosivo
	[404] = {"404", "Малюк Пердун", "Компаньйон, який блокує ворожі снаряди#При блокуванні, з 10% шансом випускає газ, який може причарувати, отруїти чи відштовхнути ворогів#Гази наносять 5-6 шкоди"}, -- Farting Baby
	[405] = {"405", "Ігровий баг", "{{Throwable}} {{ColorOrange}}Метальний{{CR}} (Натисніть двічі на кнопку вогню для запуску)#Реролить ворогів і розхідники, до яких торкається"}, -- GB Bug
	[407] = {"407", "Чистота", "↑ Підвищує одну з характеристик, залежно від аури довкола персонажа#Коли вам завдають шкоди, ви втрачаєте ауру на поточну кімнату, але отримаєте нову в наступній кімнаті#{{ColorRed}}Червона{{CR}} = {{Damage}} +4 Шкоду збільшено#{{ColorBlue}}Синя{{CR}} = {{Tears}} +2 Скорострiльнiсть збільшено#{{ColorYellow}}Жовта{{CR}} = {{Speed}} +0.5 Швидкість збільшено#{{ColorOrange}}Оранжева{{CR}} = {{Range}} +3 Дальнiсть збільшено"},
	[408] = {"408", "Атаме", "При вбивстві ворогів, на їх місці може з'явитися чорне кільце Сірки"}, -- Athame
	[415] = {"415", "Світлова корона", "{{SoulHeart}} +2 серця Душі#Якщо у персонажа повністю заповнені усі контейнери червоних сердець (або вони повністю відсутні):#↑ {{Damage}} +100% Шкоду збільшено#↓ {{Shotspeed}} -0.3 Швидкість Стрільби зменшено#Деактивується для поточної кімнати, коли персонажу завдають шкоди"}, -- Crown Of Light
	[416] = {"416", "Глибокі кишені", "Створює 1-3 монетки, якщо у кімнаті не з'явилося винагороди#{{Coin}} Збільшує ліміт монет до 999"}, -- Deep Pockets
	[417] = {"417", "Сукуб", "Літає по кімнаті і наносить 7.5-10 шкоди за секунду своєю аурою#↑ {{Damage}} Шкода від ваших атак зростає на +50%, коли Ви знаходитесь в аурі"}, -- Succubus
	[419] = {"419", "Телепорт 2.0", "Телепортує вас в іншу випадкову кімнату, яка ще не була зачищена#Ієрархія: {{Room}}>{{BossRoom}}>{{SuperSecretRoom}}>{{Shop}}>{{TreasureRoom}}>{{SacrificeRoom}}> {{DiceRoom}}>{{Library}}>{{CursedRoom}}>{{MiniBoss}}>{{ChallengeRoom}}>{{IsaacsRoom}}> {{ArcadeRoom}}>{{ChestRoom}}>{{Planetarium}}>{{SecretRoom}}>{{DevilRoom}}{{AngelRoom}}> Я - ПОМИЛКА"}, -- Teleport 2.0
	[421] = {"421", "Квасоля", "{{Charm}} Причаровує ворогів поблизу"}, -- Kidney Bean
	[422] = {"422", "Сяйливий годинник", "Повертає персонажа до попередньої кімнати та скасовує всі дії, виконані в кімнаті, де було активовано Годинник#Повернення може бути використано 3 рази на поверх#Діє як {{Collectible66}}Пісочний годинник, коли кількість повернень на поверх було вичерпано, сповільнюючи ворогів на 8 секунд"}, -- Glowing Hourglass (formerly Glowing Hour Glass)
	[426] = {"426", "Закоханий фанат", "Повторює ваші рухи з затримкою в 0.66 секунди#Наносить 30 контактної шкоди за секунду"}, -- Obsessed Fan
	[430] = {"430", "Татусь Муха", "Повторює ваші рухи з затримкою в 0.66 секунди#Стріляє в найближчих ворогів, наносячи шкоду, рівно шкоді вашого персонажа"}, -- Papa Fly
	[431] = {"431", "Міжвимірне дитя", "Повторює ваші рухи з затримкою в 0.66 секунди#Сльози, що пройдуть крізь нього, розділяться і прискоряться"},
	[432] = {"432", "Блискучі бомби", "{{Bomb}} +5 бомб#При вибуху, бомби можуть створити випадковий розхідник з шансом 63% та причарувати ворогів з шансом 15%#Після створення розхідника, шанс на новий зменшується до 1% для поточного поверху"}, -- Glitter Bombs
	[433] = {"433", "Моя тінь", "Маленька тінь, що рухається за персонажем#Коли ворог торкається тіні, з'являється дружній чорний чарджер#Чарджер наносить 5 шкоди за секунду"}, -- My Shadow
	[437] = {"437", "D7", "Відновлює всіх ворогів у кімнаті#Дозволяє фармити нагороди за зачистку кімнати"}, -- D7
	[440] = {"440", "Нирковий камінь", "Деколи персонаж може перестати стріляти і почати заряджати струменеву атаку, при якій вилетить нирковий камінь з великим потоком сліз"}, -- Kidney Stone
	[442] = {"442", "Корона Темного Принца", "!!! Коли у Вас рівно 1 Червоне серце:#↑ {{Tears}} +2 Скорострiльнiсть збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Shotspeed}} +0.2 Швидкість стрільби збільшено#Не працює для персонажів без червоних сердець"}, -- Dark Prince's Crown
	[444] = {"444", "Графітовий олівець", "Після кожних 15 пострілів, персонаж випускає град сліз"}, -- Lead Pencil
	[448] = {"448", "Кусок скла", "Коли персонажу завдають шкоди:#{{Heart}} 25% шанс появи Червоного серця#Ви починаєте стікати кров'ю, випускаючи криваві сльози у напрямку стрільби#Ви втрачатимете половинку Червоного серця кожні 20 секунд кровотечі#Кровотеча зупиниться, якщо ви відновите Червоні серця, якщо у вас не залишиться червоних сердець, або якщо ви будете на грані смерті"}, -- Shard of Glass
	[450] = {"450", "Око Жадібності", "Після кожних 20 сліз, персонаж випускає монетку-сльозу, яка наносить 1.5x Шкоди + 10#Уражені вороги гублять монетку і тимчасово перетворюються на золотих#Золоті вороги гублять 1-3 монетки при смерті#!!! Монетка-сльоза коштує 1 монету"}, -- Eye of Greed
	[451] = {"451", "Сукно таро", "{{Card}} Створює випадкову карту#{{Card}} Ефекти деяких карт підсилюються"}, -- Tarot Cloth
	[453] = {"453", "Перелом", "↑ {{Range}} +0.38 Дальнiсть збільшено#Сльози-кістки#Сльози розколюються на 1-3 осколки після зіткнення з чим завгодно"}, -- Compound Fracture
	[455] = {"455", "Татусева втрачена монета", "↑ {{Range}} +0.38 Дальнiсть збільшено#Створює щасливу монетку"}, -- Dad's Lost Coin
	[456] = {"456", "Опівнічний перекус", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Midnight Snack
	[459] = {"459", "Синусит", "{{Poison}} 20% шанс вистрелити липкою отруйною сльозою#{{Luck}} Не залежить від Удачі#Наносить шкоду як у персонажа щосекунди#Прилипає на 10 секунд"}, -- Sinus Infection
	[462] = {"462", "Око Беліала", "↑ {{Range}} +1.5 Дальнiсть збільшено#Сльози пронизують ворогів наскрізь#Після зіткнення з першим ворогом, сльоза стає самонавідною і наносить подвійну шкоду"}, -- Eye of Belial
	[464] = {"464", "Гліф рівноваги", "{{SoulHeart}} +2 Серця Душі#Збільшується шанс на появу ворогів-чемпіонів та нагороди за зачистку кімнати#Пріоритетно з'являються предмети, яких у персонажа найменше"}, -- Glyph of Balance
	[468] = {"468", "Тінь", "Повторює рух персонажа з затримкою на 1 секунду#Наносить 75 контактної шкоди за секунду#Коли Тінь нанесе 666 шкоди, її буде поглинуто персонажем, збільшуючи його контактну шкоду"}, -- Shade
	[472] = {"472", "Дитя Король", "Інші компаньйони рухаються слідом за ним і автоматично стріляють у ворогів#Перестає рухатись, коли ви стріляєте#Телепортується до персонажа, коли ви перестанете стріляти"}, -- King Baby
	[474] = {"474", "Розбита скляна гармата", "Перетворюється у Скляну гармату при використанні"}, -- Broken Glass Cannon
	[476] =	{"476", "D1", "Дублює 1 випадковий розхідник у кімнаті#Дублікати розхідників можуть відрізнятися від оригіналу"}, -- D1
	[477] = {"477", "Порожнеча", "!!! При використанні, поглинає усі п'єдестальні артефакти в кімнаті#Активний артефакт: Його ефект буде спрацьовувати при кожному наступному використанні Порожнечі#↑ Пасивний артефакт: Незначне покращення для 2-ох випадкових характеристик"},
	[487] = {"487", "Картоплечистка", "Забирає один Контейнер червоних сердець: #↑ {{Damage}} +0.2 Шкоду збільшено#{{Collectible73}} Кубик М'яса#↑ {{Range}} +1.5 Дальності та кривавий слід за персонажем у поточній кімнаті"}, -- Potato Peeler
	[489] = {"489", "D Безмежність", "Може бути використаним як будь-який кубик окрім {{Collectible723}} Кубика Прокрутки#Змінюйте функціонал кубика з допомогою {{ButtonRT}}#Час зарядки залежить від типу використаного кубика"}, -- D Infinity
	[491] = {"491", "Кислотне дитя", "{{Pill}} Створює випадкову пігулку кожні 7 хвилин#Використовуючи пігулки, ви отруюєте всіх ворогів в кімнаті"}, -- Acid Baby
	[493] = {"493", "Адреналін", "↑ {{Damage}}  Шкода збільшується за кожен пустий контейнер червоних сердець:#+0.3 за 1#+0.92 за 2#+1.76 за 3#+2.79 за 4#+3.98 за 5"}, -- Adrenaline
	[494] = {"494", "Драбина Якова", "Сльози створюють електричні іскри при влучанні#Іскри наносять половину вашої шкоди#Іскри можуть стрибати між ворогами"}, -- Jacobs Ladder
	[495] = {"495", "Перець-привид", "8.33% шанс вистрілити синім вогнем, який блокує ворожі сльози та наносить контактну шкоду#{{Luck}} 50% шанс при Удачі 10#Вогонь гасне через 2 секунди"}, -- Ghost Pepper
	[496] = {"496", "Евтаназія", "3.33% шанс вистрілити голкою#{{Luck}} 50% шанс при Удачі 15#Голки миттєво вбивають звичайних ворогів, перетворюючи їх на 10 сліз#Голки наносять 3x Вашої шкоди босам"}, -- Euthanasia
	[497] = {"497", "Камуфляжні труси", "Заходячи в кімнату, ви зливаєтесь з оточенням та бентежите всіх ворогів#Камуфляж зникає при першому пострілі#↑ {{Speed}} +0.5 Швидкість збільшено, поки діє маскування#При зникненні камуфляжу, наносить шкоду ворогам поблизу та збільшує ваші Скорострiльнiсть і Шкоду на короткий проміжок часу"},
	[501] = {"501", "Стравохід Жадібності", "+1 Контейнер сердець за кожні 25 монет у вас#{{Player14}} / {{Player33}}Хранитель може отримати додаткові Серця-Монетки#{{Collectible416}} +1 Контейнер за кожні 100 монет, якщо ви зібрали понад 99"}, -- Greed's Gullet
	[503] = {"503", "Маленький Ріг", "5% шанс випустити сльозу, яка викликає руку Великого Рогу#{{Luck}} 20% шанс при Удачі 15#Рука миттєво вбиває ворогів, може ламати турелі та наносить 36 шкоди босам#Персонаж наносить 7 контактної шкоди за секунду"}, -- Little Horn
	[504] = {"504", "Коричневий самородок", "Створює муху-турель, яка стріляє у ворогів#Кожен її постріл наносить 3.5 шкоди"}, -- Brown Nugget
	[506] = {"506", "І ти, Бруте?", "Якщо сльоза попадає ворогу в спину, вона наносить подвійну шкоду та накладає ефект кровотечі: вороги залишають під собою кривавий слід, який наносить їм шкоду"}, -- Backstabber
	[507] = {"507", "Гостра соломинка", "{{Damage}} Наносить вашу шкоду + 10% від максимального здоров'я ворогів#Діє на всіх ворогів в кімнаті#{{HalfHeart}} Шанс на появу половинки червоного/синього серця, коли предмет наносить шкоду ворогам"},
	[508] = {"508", "Матусина бритва", "Орбіталь, що наносить контактну шкоду#Уражені вороги залишають кривавий слід і отримують шкоду при русі#{{Damage}} Наносить 1.5x шкоди персонажа за секунду"},
	[509] = {"509", "Криваве око", "Орбіталь, що стріляє кожні 0.33 секунди, якщо поруч є вороги#Одна сльоза наносить 3.5 шкоди#Наносить 20 контактної шкоди за секунду"}, -- Bloodshot Eye
	[514] = {"514", "Зламаний модем", "Змушує випадкових ворогів та їх снаряди 'заглючити' на випадковий проміжок часу#25% шанс на подвоєну винагороду за зачистку кімнати"},
	[517] = {"517", "Швидкі бомби", "{{Bomb}} +7 бомб#Дозволяє ставити бомби швидше#Бомби не відштовхують одна одну"}, -- Fast Bombs
	[523] = {"523", "Коробка для перенесень", "При використанні, збирає у себе до 10 розхідників з поточної кімнати#Повторне використання викине всі предмети на підлогу#Це дозволяє переносити речі між кімнатами"}, -- Moving Box
	[524] = {"524", "Технологія Нуль", "Сльози з'єднані між собою пучками електрики#Струм наносить x4.5 шкоди персонажа за секунду"}, -- Technology Zero
	[531] = {"531", "Гемолакрія", "Сльози летять по навісній траєкторії і розсипаються на дрібніші при влучанні#↑ {{Damage}} +1 шкоду збільшено#↑ {{Damage}} +50% множник шкоду#↓ {{Tears}} -67% Скорострiльнiсть знижено#↓ {{Range}} -20% Дальнiсть знижено"}, -- Haemolacria
	[543] = {"543", "Свята земля", "Створює купку білого лайна, коли вам завдають шкоди#Коли персонаж знаходиться в аурі лайна:#↑ {{Damage}} +25% Шкоду збільшено#↑ {{Tears}} +150% Скорострiльнiсть збільшено#Самонавідні сльози#Шанс заблокувати шкоду"}, -- Hallowed Ground
	[549] =	{"549", "Крихкі кістки", "Замінює усі ваші контейнери червоних сердець на 6 Кісткових сердець#При втраті кісткового серця:#Випускає 8 кісткових сліз в усі сторони#↑ +0.4 Скорострiльнiсть збільшено назавжди"}, -- Brittle Bones
	[552] = {"552", "Матусина лопата", "Створює люк на наступний поверх#Створює {{LadderRoom}}вхід у криївку, якщо використано на декоративній клітинці (трава, камінці, папірці, коштовні камені і т.д.)"}, --Mom's Shovel
	[553] = {"553", "Мукормікоз", "25% шанс вистрелити липкими слізьми-спорами#{{Luck}} Не залежить від Удачі#Спори вибухають після 2.5 секунд, наносячи шкоду, отруюючи ворогів поруч та випускаючи ще більше спор"}, -- Mucormycosis
	[554] = {"554", "Страшко", "{{Fear}} Лякає ворогів у невеликому радіусі довкола вас"}, -- 2Spooky
	[555] = {"555", "Золота бритва", "{{Coin}} Перетворює 5 монет у {{Damage}} +1.2 шкоди для поточної кімнати#{{Coin}} +5 монет"}, -- Golden Razor
	[556] = {"556", "Сульфур", "{{Collectible118}} Лазер Сірки для поточної кімнати#При повторній активації збільшує +1.8 шкоду та розміри лазера для поточної кімнати"}, -- Sulfur
	[557] = {"557", "Печиво з передбаченнями", "При активації дає щось зі списку: #Передбачення#{{SoulHeart}} Серце Душі#{{Card}} Карту таро#{{Rune}} Рун чи Камінь Душі#{{Trinket}} Брелок"}, -- Fortune Cookie
	[558] = {"558", "Окаїстий", "Шанс вистрелити 1-3 додатковими слізьми у випадкові сторони#{{Luck}} Не залежить від Удачі"}, -- Eye Sore
	[559] = {"559", "120 Вольт", "Електричний розряд, що постійно б'є ворогів, які знаходяться поруч з персонажем#{{Damage}} Струм наносить до x3.75 від вашої шкоди за секунду"}, -- 120 Volt
	[560] = {"560", "Болить!", "Випускає кільце з 10 сліз, які наносять по 10 шкоди#↑ {{Tears}} +1.2 Скорострiльнiсть збільшено при першому ударі#↑ {{Tears}} +0.4 для кожного наступного удару"}, -- It Hurts
	[561] = {"561", "Мигдалеве молоко", "↑ {{Tears}} 4x Скорострiльнiсть збільшено#↓ {{Damage}} -70% Шкоду зменшено#Сльози отримують випадкові ефекти черв'якових брелків і деяких артефактів"}, -- Almond Milk
	[562] = {"562", "Кам'яне дно", "↑ Закріплює найвищі значення характеристик персонажа до кінця забігу#Фактично створює дві таблиці характеристик, в одній з яких зберігаються максимальні значення, а в другій - реальні#Реальні значення впливають на подальші покращення (якщо значення максимальної шкоди 25, а фактичне 12, то підбір артефакту на +1 шкоди не змінить максимального значення)"}, -- Rock Bottom
	[563] = {"563", "Гарненькі бомбочки", "{{Bomb}} +5 бомб#Бомби вибухають з випадковим ефектом"}, -- Nancy Bombs
	[564] = {"564", "Кусок мила", "↑ {{Tears}} +0.5 Темп Стрiльби збільшено#↑ {{Shotspeed}} +0.2 Швидкість стрільби збільшено"}, -- A Bar of Soap
	[565] = {"565", "Кривавий цуцик", "Компаньйон, що ганяється за ворогами#Після 15 вбивств, він виростає, наносить більше шкоди, але і намагається напасти на вас#Після вбивства 40 ворогів (сумарно), він стає ще сильнішим і може ламати камені#Атакуючи його, ви можете повернути цуцика на попередні стадії"}, -- Blood Puppy
	[566] = {"566", "Ловець снів", "{{HalfSoulHeart}} +0.5 серця Душі при переході на наступний поверх#У сновидінні при переході між поверхами відображає: #{{TreasureRoom}} артефакт у Золотій кімнаті#{{BossRoom}} наступного боса"}, -- Dream Catcher
	[567] = {"567", "Пасхальна свічка", "↑ {{Tears}} +0.4 Скорострiльнiсть збільшується за кожну кімнату, зачищену без отримання шкоди#{{Tears}} Максимум до +2 Скорострільності"}, -- Paschal Candle
	[568] = {"568", "Божественне втручання", "Натисніть на кнопки стрільби двічі, щоб створити щит#Щит існує 1 секунду, відштовхує ворогів і відбиває ворожі снаряди і лазери"}, -- Divine Intervention
	[569] = {"569", "Присяга на крові", "Б'є персонажа ножем на початку кожного поверху, забираючи червоні серця (залишає 0.5 червоного серця)#Збільшує характеристики на весь поверх:#↑ {{Damage}} Шкода + 0.15 * ВтраченіСерця^2#↑ {{Speed}} Швидкість + 0.05*ВтраченіСерця"}, -- Blood Oath
	[570] = {"570", "Пластилінове печиво", "Кольорові сльози з різними ефектами"}, -- Playdough Cookie
	[571] = {"571", "Сирітські шкарпетки", "Шипи і рідина на підлозі не завдають персонажу шкоди#{{Speed}} +0.3 Швидкість збільшено#{{SoulHeart}} +2 серця Душі"}, -- Orphan Socks
	[572] = {"572", "Окультне око", "Контрольовані сльози#↑ {{Damage}} +1 Шкоду збільшено#↑ {{Range}} +2 Дальнiсть збільшено#↓ {{Shotspeed}} -0.16 Швидкість стрільби зменшено"}, -- Eye of the Occult
	[573] = {"573", "Бездоганне серце", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Повне здоров'я#↑ {{Damage}} +20% Шкоду збільшено#20% шанс вистрелити додатковими орбітальними спектральними слізьми"}, -- Immaculate Heart
	[574] = {"574", "Дароносиця", "Дві кругові аури довкола персонажа, які завдають ворогам шкоди#Внутрішня аура наносить більше шкоди"}, -- Monstrance
	[575] = {"575", "Загарбник", "Компаньйон у вашій голові, що випускає по 4 сповільнювальні сльози за постріл#При отриманні шкоди персонажем, компаньйон може вирватись назовні"}, -- The Intruder
	[576] = {"576", "Брудні думки", "Усі Діпи (малі какашки) стають дружніми#Створює 1-4 Діпів при руйнуванні купок лайна#Тип Діпа залежить від типу купи лайна#Камені можуть бути замінені на лайно"}, -- Dirty Mind
	[577] = {"577", "Дамокл", "Створює меч над вашою головою, який подвоює всі п'єдестали артефактів#Не подвоює кількість предметів в Магазині, Скрині чи під час угод з Дияволом#!!! Вбиває вас у випадковий момент, якщо ворог завдасть вам шкоди"}, -- Damocles
	[578] = {"578", "Безкоштовний лимонад", "Створює гігантську калюжу жовтої рідини#Рідина наносить 24 шкоди за секунду"}, -- Free Lemonade
	[579] = {"579", "Меч Духа", "Замість сліз, персонаж махає мечем#Наносить x3 + 3.5 вашої шкоди#{{Chargeable}} Утримування кнопки атаки дозволяє зарядити кругову атаку, яка наносить x8 + 10 шкоди персонажа#Додатково випускає сльози при нормальних ударах, якщо здоров'я персонажа рівне або більше за кількість червоних контейнерів"}, -- Spirit Sword
	[580] = {"580", "Червоний ключ", "Створює нову кімнату, що прилягає до стіни з контуром червоних дверей#Кімнати можуть бути спеціальними (золоті кімнати, магазини, угоди з янголом/дияволом тощо)#Кімната ззовні квадрата 13х13 кімнат (стандартного розміру карти) телепортує вас в Я - ПОМИЛКА"}, -- Red Key
	[581] = {"581", "Психо-Муха", "Орбітальний компаньйон-муха#Переслідує і знищує ворожі снаряди#Наносить контактну шкоду"}, -- Psy Fly
	[582] = {"582", "Хвиляста шапочка", "↑ {{Tears}} +0.75 Скорострiльнiсть збільшено#↓ {{Speed}} -0.03 Швидкість знижено#Спотворює екран#Ефект від кількох застосувань додається"}, -- Wavy Cap
	[583] = {"583", "Ракета в банці", "{{Bomb}} +5 бомб#Бомби, поставлені при стрільбі, перетворюються на ракети, що летять в сторону вашої атаки"}, -- Rocket in a Jar
	[584] = {"584", "Книга Чеснот", "Створює орбітального компаньйона-вогника, який стріляє спектральними слізьми, але може бути знищений#Може поєднуватись з другим активним предметом, чим підсилює його ефекти і може створити тематичних вогників#Замість {{DevilRoom}} кімнати Диявола, першою буде з'являтись {{AngelRoom}} кімната Ангела#{{AngelChance}} +12.5% збільшений шанс на появу Кімнати Ангела#{{AngelChance}} Кімнати Ангела можуть з'являтись навіть якщо ви вже уклали угоду з Дияволом"}, -- Book of Virtues
	[585] = {"585", "Алебастрова скринька", "При використанні, створює: #{{SoulHeart}} 3 серця Душі#{{AngelRoom}} 2 предмети з пулу Кімнати Ангела#{{SoulHeart}} Заряджається серцями Душі#{{DevilRoom}} Створює лише 2 серця Душі та 1 предмет Ангела, якщо раніше ви укладали угоду з Дияволом"}, -- Alabaster Box
	[586] = {"586", "Сходи", "Створює драбину в стартовій кімнаті кожного поверху#Вони ведуть до унікального магазину {{AngelRoom}} Кімнати Ангела з предметами та розхідниками"}, -- The Stairway
	[587] = {"587", "Менора (Не використовується, але заскриптовано)", "<Item does not exist>"}, -- Menorah (Unused but scripted)
	[588] = {"588", "Сонце", "{{BossRoom}} Відображає локацію кімнати боса на міні-карті#Після перемоги над босом, дає ефекти до кінця поверху: #{{Card20}} Активує ефект карти Сонце#{{Battery}} Повністю заряджає ваш активний артефакт#{{CurseBlind}} Знімає будь-які прокляття#↑ {{Damage}} +3 Шкоди#↑ {{Luck}} +1 Удачі"}, -- Sol
	[589] = {"589", "Місяць", "Додаткові {{SecretRoom}} Секретна та {{SuperSecretRoom}} Суперсекретна кімнати на кожному поверсі#{{SecretRoom}} У Секретних кімнатах з'являється промінь світла, який збільшує #{{Tears}} Темп Стрільби на цілий поверх та дає{{HalfSoulHeart}} половинку серця Душі#{{SecretRoom}} Відображає локацію однієї з Секретних кімнат на кожному поверсі"}, -- Luna
	[590] = {"590", "Меркурій", "↑ {{Speed}} +0.4 Швидкість збільшено#Двері у кімнатах залишаються відкритими, навіть якщо кімнату не було зачищено"}, -- Mercurius
	[591] = {"591", "Венера", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце#{{Charm}} Зачаровує ворогів поблизу персонажа"}, -- Venus
	[592] = {"592", "Земля", "↑ {{Damage}} +1 Шкоду збільшено#Замінює сльози на камені#Камені можуть наносити x0.5 - x2 шкоди персонажа#Можуть знищувати перешкоди та відкривати прохід у Секретні кімнати#Посилене відштовхування"}, -- Terra
	[593] = {"593", "Марс", "Двічі натисніть на кнопки ходьби, щоб здійснити ривок, під час якого персонаж стає невразливим та наносить 4x шкоди#Перезаряджання триває 3 секунди"}, -- Mars
	[594] = {"594", "Юпітер", "↑ {{Heart}} +2 Контейнери з червоними серцями#{{HalfHeart}} Відновлює половинку червоного серця#↓ {{Speed}} -0.3 Швидкість знижено#↑ {{Speed}} Стоячи на місці, персонаж нарощує свою швидкість до +0.5#{{Poison}} При русі, персонаж випускає хмари отруйного газу, а накопичена швидкість зменшується до норми#{{Poison}} Імунітет до отрути"}, -- Jupiter
	[595] = {"595", "Сатурн", "У вас з'являється орбіта#При вході в нову кімнату, 7 сліз персонажа починають кружляти навколо вас#Ці сльози існують 13 секунд та наносять x1.5 +5 шкоди персонажа#Шанс спіймати ворожі снаряди на орбіту"}, -- Saturnus
	[596] = {"596", "Уран", "{{Freezing}} Ви стріляєте льодяними слізьми, які сповільнюють ворогів та перетворюють на лід тих, кого вб'ють#При поштовху, заморожені вороги починають котитися і розбиваються на 6 крижаних осколків"}, -- Uranus
	[597] = {"597", "Нептун", "{{Chargeable}} Заряджуваний (автоматично)#Поки ви не стріляєте, протягом 3 секунд накопичує значний запас сліз в роті#При стрільбі персонаж швидко випускає накопичені сльози"}, -- Neptunus
	[598] = {"598", "Плутон", "↑ {{Tears}} +0.7 Темп Стрiльби збільшено#Суттєво зменшує розміри Айзека, дозволяючи йому проходити між об'єктами#Ворожі снаряди можуть пролітати над персонажем"}, -- Pluto
	[599] = {"599", "Голова вуду", "{{CursedRoom}} Створює додаткову Прокляту Кімнату на кожному поверсі#Покращує Прокляті Кімнати і нагороди в них#Створює випадкову монетку в кожній Проклятій кімнаті"}, -- Voodoo Head
	[600] = {"600", "Очні краплі", "↑ {{Tears}} +30% Скорострiльнiсть збільшено, але лише для лівого ока#↑ {{Tears}} +20% Скорострiльнiсть збільшено для атак не слізьми#Перший постріл завжди є подвійним#"}, -- Eye Drops
	[601] = {"601", "Каяття", "↑ {{Tears}} +0.7 Темп Стрiльби збільшено#{{EternalHeart}} +1 Вічне Серце#{{AngelChance}} Кімнати Ангела можуть з'являтись, навіть якщо ви вже укладали угоду з Дияволом#Отримання шкоди не так сильно знижує шанс на появу кімнат Диявола/Ангела"}, -- Act of Contrition
	[602] = {"602", "Членська карта", "{{Shop}} У кожному магазині з'являється люк до ще одного магазину з унікальними товарами"}, -- Member Card
	[603] = {"603", "Акумуляторна батарея", "{{Battery}} Створює 2-4 батарейки#Повністю перезаряджає ваш активний предмет"}, -- Battery Pack
	[604] = {"604", "Матусин браслет", "Дозволяє підіймати і кидати камені, динаміт, купки лайна, дружніх Діпів, Хостів та інші перешкоди#Дозволяє переносити їх між кімнатами"}, -- Mom's Bracelet
	[605] = {"605", "Колупачка", "При використанні:#Створює компаньйона Споглядача для поточної кімнати, який залишає за собою кривавий слід#↑ {{Damage}} +34% Множник шкоди для правого ока"}, -- The Scooper
	[606] = {"606", "Очний розлом", "5% шанс вистрілити слізьми, які створюють розломи на місці падіння#{{Luck}} 20% шанс при Удачі 15#Розломи наносять шкоду та притягують ворогів, снаряди та розхідники"}, -- Ocular Rift
	[607] = {"607", "Чирякове Дитя", "Компаньйон, який хаотично випускає шквал сліз у всі сторони#Наносить 3.5 або 5.3 Шкоди кожною сльозою"}, -- Boiled Baby
	[608] = {"608", "Морозне Дитя", "Компаньйон, який стріляє паралітичними слізьми#Заморожує ворогів, коли вбиває їх"}, -- Freezer Baby
	[609] = {"609", "Вічний D6", "Реролить п'єдестали в кімнаті#25% шанс, що п'єдестальний предмет зникне"}, -- Eternal D6
	[610] = {"610", "Пташина клітка", "При отриманні персонажем шкоди, компаньйон злазить з вашої голови та скаче на ворога#Наносить 45 шкоди та викликає кам'яну хвилю#Після цього починає переслідувати ворогів"}, -- Bird Cage
	[611] = {"611", "Гортань", "Персонаж кричить, наносячи шкоду та відштовхуючи ворогів#Сила крику залежить від кількості зарядів у предмета"}, -- Larynx
	[612] = {"612", "Загублена душа", "Компаньйон-душа, яка помирає від одного удару, але воскресає на початку наступного поверху#Якщо вона не помре, на наступному поверсі створить {{SoulHeart}} 3 серця Душі, {{EternalHeart}} 2 Вічні серця, або предмет зі {{TreasureRoom}} Скарбниці чи {{AngelRoom}} кімнати Ангела"}, -- Lost Soul
	[613] = {"613", "", "<Item does not exist>"}, -- Salt Shaker
	[614] = {"614", "Кров'яні бомби", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Відновлює 4 червоні серця#{{HalfHeart}} Якщо у гравця немає бомб, то можна поставити одну за половинку серця#Бомби залишають кривавий слід"}, -- Blood Bombs
	[615] = {"615", "Малюк Дампі", "Компаньйон-пердун#Пердить прямо перед зіткненням персонажа з ворогом/снарядом, чим відштовхує від вас небезпеку#Після пердіння дезактивується і відлітає у випадковому напрямку#Підійдіть до нього, щоб знову активувати"}, -- Lil Dumpy
	[616] = {"616", "Пташине око", "8% шанс вистрілити червоним вогнем, який блокує ворожі постріли та наносить контактну шкоду#{{Luck}} 50% шанс при Удачі 10#Вогонь може заблокувати до 4 пострілів та/або нанести контактну шкоду 4 рази, після чого гасне#Гасне через 10 секунд"}, -- Bird's Eye
	[617] = {"617", "Магнітна руда", "{{Magnetize}} 17% шанс вистрелити сльозою, що намагнічує ворогів#{{Luck}} 100% шанс при Удачі 5#Намагнічені вороги притягують до себе інших ворогів, снаряди та розхідники"}, -- Lodestone
	[618] = {"618", "Гнилий томат", "{{Bait}} 17% шанс вистрелити сльозою, що позначає ворогів#{{Luck}} 100% шанс при Удачі 5#Позначених ворогів атакуватимуть інші вороги"}, -- Rotten Tomato
	[619] = {"619", "Право первородства", "Свій ефект для кожного персонажа"}, -- Birthright
	[620] = {"620", "", "<Item does not exist>"},
	[621] = {"621", "Червоне рагу", "↑ {{Damage}} +21.6 Шкоду тимчасово збільшено#{{Heart}} Повне здоров'я#Бонус шкоди повільно знижується протягом 3 хвилин#Вбивайте ворогів, щоб продовжити тривалість ефекту"}, --
	[622] = {"622", "Генезис", "Прибирає всі артефакти та розхідники з інвентаря персонажа#Телепортує вас в унікальну спальню з розхідниками, скринями та люком#За кожен втрачений артефакт, вам пропонують вибір із 3 нових предметів"}, -- Genesis
	[623] = {"623", "Гострий ключ", "{{Key}} +5 ключів#Ви можете стріляти ключами щоб наносити шкоду ворогам, відкривати двері та знищувати перешкоди#З ворогів, вбитих ключем, може випасти вміст скринь, в тому числі артефакти"}, -- Sharp Key
	[624] = {"624", "Бустер-пак", "{{Card}} Створює 5 випадкових карток"}, -- Booster Pack
	[625] = {"625", "Мегагриб", "Персонаж стає гігантом на 30 секунд, ефект працює між кімнатами#Поки ви гігант:#↑ {{Damage}} +300% множник шкоди#↑ {{Range}} +7 Дальнiсть збільшено#↓ {{Tears}} -60% Скорострiльнiсть знижено#Ви можете топтати ворогів та перешкоди#Повна невразливість"}, -- Mega Mush
	[626] = {"626", "1 частина ножа", "Перша частина ножа-компаньйона"}, -- Knife Piece 1
	[627] = {"627", "2 частина ножа", "Разом з {{Collectible626}} 1 частиною ножа утворюють ножа-компаньйона#Наносить шкоду ворогам#Може відкрити двері з плоті"}, -- Knife Piece 2
	[628] = {"628", "Свідоцтво про смерть", "Ви потрапляєте на поверх, який містить усі ігрові предмети#!!! Ви можете взяти тільки 1 предмет#Обравши артефакт, ви повернетесь в кімнату, в якій ви були"}, -- Death Certificate
	[629] = {"629", "Робомуха", "Орбітал, що стріляє броньованими слізьми по ворожих снарядах"}, -- Bot Fly
	[630] = {"630", "", "<Item does not exist>"},
	[631] = {"631", "Тесак м'ясника", "Розрізає усіх ворогів у кімнаті навпіл, створючи по 2 зменшені копії ворога зі значно меншим запасом здоров'я"}, -- Meat Cleaver
	[632] = {"632", "Амулет зла", "↑ {{Luck}} +2 Удачу збільшено#Імунітет до вогню, спантеличення, страху, отрути та токсичних газів"}, -- Evil Charm
	[633] = {"633", "Догма", "Політ та одноразовий ефект {{Collectible313}} Святої Мантії#↑ {{Damage}} +2 Шкоду збільшено#↑ {{Speed}} +0.1 Швидкість збільшено#Якщо у гравця менше 6 сердець, піднімає здоров'я до 6 сердець комбінацією з червоних та синіх сердець"}, -- Dogma
	[634] = {"634", "Чистилище", "Поки у кімнаті є вороги, створює розломи в підлозі#Коли ви наступаєте на ці розломи, з них вилітають вибухові привиди"}, -- Purgatory
	[635] = {"635", "Стібок", "Пасивно створює компаньйона, який рухається в напрямку стрільби персонажа#При використанні, персонаж міняється місцями зі Стібком і отримує короткочасну невразливість#Телепортація в перешкоди та ворогів може завдати шкоди чи знищити їх"}, -- Stitches
	[636] = {"636", "Клавіша R", "Повертає вас на 1 поверх і починає новий забіг#Предмети, характеристики та підібрані розхідники зберігаються в інвентарі персонажа"}, -- R Key
	[637] = {"637", "Нокаутні краплі", "10% шанс вистрілити кулаком з сильним відштовхуванням та ефектом спантеличення#{{Luck}} 100% шанс при Удачі 9#Вороги отримують шкоду, коли їх відштовхує на стіни чи перешкоди"}, -- Knockout Drops
	[638] = {"638", "Стирачка", "Персонаж кидає гумкою, яка миттєво вбиває ворога#Вороги цього типу не будуть з'являтися до кінця забігу#Наносить 15 шкоди босам#Резинка \"стирає\" боса, якщо удар нею був смертельним#Може бути використана лише 1 раз за поверх"}, -- Eraser
	[639] = {"639", "Гидотне серце", "{{RottenHeart}} Дає Гниле серце при використанні"}, -- Yuck Heart
	[640] = {"640", "Урна душ", "Вивергає потік полум'я#Заряджається на 1 поділку за кожну смерть ворога"}, -- Urn of Souls
	[641] = {"641", "Акелдама", "Створює ланцюг зі сліз за вами під час бою#Сльози наносять по 3.5 шкоди кожна"}, -- Akeldama
	[642] = {"642", "Чарівна шкіра", "Перетворює {{EmptyHeart}} 1 Контейнер Червоних сердець або {{SoulHeart}} 2 серця Душі в {{BrokenHeart}} Розбите серце, яке ніколи не буде заповнене#Створює предмет з пулу поточної кімнати#З кожним використанням збільшується шанс, що Чарівна Шкіра замінить майбутні предмети собою, якщо Айзек не триматиме її в інвентарі#33% після 1 використання, 50% після 2, 100% після 3#Шанс зменшується, якщо Чарівна Шкіра вже є на одному з п'єдесталів поточного поверху#{{Warning}} Одноразовий для персонажа Загублений"}, -- Magic Skin
	[643] = {"643", "Одкровення", "{{Chargeable}} Заряджуваний Святий Лазер#Політ та {{SoulHeart}} 2 серця Душі"}, -- Revelation
	[644] = {"644", "Втішний приз", "↑ Підвищує вашу найнижчу характеристику#Створює {{Coin}} 3 монетки, {{Bomb}} 1 бомбу або {{Key}} 1 ключ, залежно від того, чого у вас найменше"}, -- Consolation Prize
	[645] = {"645", "Мінітома", "Тератома-орбітал#Блокує постріли#Наносить контактну шкоду#Розділяється на 2 менші копії себе після отримання/нанесення 3 ударів#Менші копії розриваються на синіх павуків#Відновлюється через 5 секунд після повного зникнення"}, -- Tinytoma
	[646] = {"646", "Сірчані бомби", "{{Bomb}} +5 бомб#{{Collectible118}} Бомби випускають Сірчані криваві лазери на 4 сторони"}, -- Brimstone Bombs
	[647] = {"647", "4.5 Вольт", "Активні предмети не заряджаються від зачистки кімнат#Натомість вони заряджаються, коли ви наносите шкоду ворогам#Формула: (40 + 20 * поверх) шкоди = 1 заряд"}, -- 4.5 Volt
	[648] = {"648", "", "<Item does not exist>"},
	[649] = {"649", "Мала Слива", "Мініатюрна Сливова Крихітка-компаньйон#Літає по діагоналі по кімнаті, стріляючи слізьми назад#Сльози наносять 3 шкоди#Наносить 6 контактної шкоди за секунду"}, -- Fruity Plum
	[650] = {"650", "Сливова флейта", "Викликає дружню Сливову Крихітку в поточну кімнату на 10 секунд"}, -- Plum Flute
	[651] = {"651", "Вифлеємська зірка", "Компаньйон, що випромінює ауру та повільно прямує до {{BossRoom}} кімнати боса#Прискорюється, якщо ви її випереджаєте і, навпаки, сповільнюється, коли персонаж відстає#Поки ви стоїте в аурі:#↑ {{Damage}} x1.8 множник шкоди#↑ {{Tears}} x2.5 множник темпу стрiльби#Самонавідні сльози#50% шанс ігнорувати отриману шкоду"}, -- Star of Bethlehem
	[652] = {"652", "Дитя в кубі", "Компаньйон, що ковзає по кімнаті, коли ви його штовхаєте#{{Freezing}} Сповільнює ворогів та наносить їм шкоду при контакті, заморожує вбитих монстрів"}, -- Cube Baby
	[653] = {"653", "Повернись!", "Поки ви тримаєте цей предмет, вороги-не-привиди при смерті будуть залишати малі червоні душі#При активації предмета, ці душі вибухають"}, -- Vade Retro
	[654] = {"654", "Фальшивий Доктор Наук", "{{Heart}} +1 Чорне серце#{{Pill}} Ідентифікує всі пігулки#{{Pill}} Хороші пігулки стають поганими#↑ {{Damage}} Пігулки, що знижують ваші характеристики, додатково збільшують вашу шкоду на +0.6#{{BlackHeart}} Інші пігулки при використанні створюють Чорне серце"}, -- False PHD
	[655] = {"655", "Крути, щоб виграти", "Орбіталь-дзиґа, який блокує ворожі постріли#Наносить 10.5 контактної шкоду за секунду#При активації, збільшує вашу {{Speed}} ↑ +0.5 Швидкість та значно прискорює орбіталі"}, -- Spin to Win
	[656] = {"656", "Дамокл", "<Item not obtainable>"}, -- Damocles
	[657] = {"657", "Васкуліт", "При смерті, ворогів розриває на 1-16 сліз, що летять у випадкових напрямках#Сльози отримують ефекти сліз персонажа"}, -- Vasculitis
	[658] = {"658", "Гігантська клітина", "Створює міні-Айзеків, коли персонажу завдають шкоди#Вони переслідують і стріляють у ворогів"}, -- Giant Cell
	[659] = {"659", "Тропікамід", "↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Tearsize}} Розмір сліз збільшено"}, -- Tropicamide
	[660] = {"660", "Ворожіння на картах", "Створює 2 портали на початку кожного поверху#Портали зникають, коли ви покидаєте кімнату#{{ColorRed}}Червоний: {{CR}}{{BossRoom}} Кімната боса#{{ColorYellow}}Жовтий: {{CR}}{{TreasureRoom}} Скарбниця#{{ColorBlue}}Синій: {{CR}}{{SecretRoom}} Секретна кімната"}, -- Card Reading
	[661] = {"661", "П'ятірня", "Створює стаціонарного компаньйона на місці смерті ворога#До 5 компаньйонів"}, -- Quints
	[662] = {"662", "Пацифіст (Видалено)", "<Item does not exist>"}, -- Pacifist (Cut item)
	[663] = {"663", "Зуб і цвях", "Кожні 6 секунд персонаж отримує ефект невразливості на 1 секунду#Мигає прямо перед активацією/дезактивацією ефекту"}, -- Tooth and Nail
	[664] = {"664", "Ненажера", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Повне здоров'я#Їжа відновлює 3 червоні серця#Артефакти на п'єдесталах періодично змінюються на їжу і назад#Коли ви піднімаєте артефакти їжі: #↑ {{Damage}} тимчасове збільшення +3.6 шкоди#↑ 2 незначні перманентні підвищення характеристик#↓ {{Speed}} -0.03 Швидкість знижено"}, -- Binge Eater
	[665] = {"665", "Око Гаппі", "Показує вміст {{Chest}} Скринь, {{GrabBag}} Мішечків, Крамарів та Вогнищ, перш ніж вони були розкриті"}, -- Guppy's Eye
	[666] = {"666", "", "<Item does not exist>"},
	[667] = {"667", "Опудало", "{{Bomb}} +1 Бомба#{{Player14}} Створює Хранителя як другого персонажа з власним здоров'ям#Коли він помирає, з'являються сині павуки, а предмет зникає з вашого інвентарю#{{DevilRoom}} Поки Хранитель живий, предмети в Кімнаті Диявола продаються за монети#Хранитель може піднімати будь-які пасивні артефакти, в тому числі сюжетні# !!! При смерті Хранителя, ці артефакти зникнуть"}, -- Strawman
	[668] = {"668", "Записка від батька", "Розпочинає процес підйому для доступу до поверху Дім#Брелки, залишені у {{TreasureRoom}} Скарбницях чи {{BossRoom}} Кімнатах боса, перетворюються у {{Card78}} Зламаний Ключ"}, -- Dad's Note
	[669] = {"669", "Ковбаска", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Повне здоров'я#↑ {{Damage}} +0.5 Шкоду збільшено#↑ {{Tears}} +0.5 Темп Стрiльби збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Speed}} +0.2 Швидкість збільшено#↑ {{Shotspeed}} +0.16 Швидкість стрільби збільшено#↑ {{Luck}} +1 Удачу збільшено#↑ {{AngelDevilChance}} +6.9% шанс на появу кімнат Диявола та Ангела#↑ {{PlanetariumChance}} +6.9% шанс на появу Планетарію"}, -- Sausage
	[670] = {"670", "Варіанти?", "За зачистку кімнат ви отримаєте дві нагороди на вибір#Коли ви піднімаєте одну з нагород, інша зникає"}, -- Options?
	[671] = {"671", "Цукеркове серце", "Випадкове перманентне збільшення характеристик, коли персонаж піднімає червоні серця#{{Heart}} Створює 1 Червоне серце"}, -- Candy Heart
	[672] = {"672", "Фунт м'яса", "{{DevilRoom}} Предмети угод з Дияволом тепер продаються за монети#{{Shop}} Предмети у магазині продаються за серця#Розхідники у магазинах безкоштовні, але оточені шипами"}, -- A Pound of Flesh
	[673] = {"673", "Спокута", "{{DevilRoom}} Якщо ви заходили в кімнату Диявола, але нічого там не взяли/купили:#{{SoulHeart}} +1 серце Душі#↑ {{Damage}} +1 Шкоду збільшено"}, -- Redemption
	[674] = {"674", "Духовні кайдани", "При смерті, душа Айзека залишається прикованою до його тіла і продовжує бій з половинкою серця#Персонаж воскресає через 10 секунд, якщо душа не помре#Предмет перезаряджається при підйомі серця Душі"}, -- Spirit Shackles
	[675] = {"675", "Розбита куля", "Коли вам завдають шкоди:#Відчиняє всі зачинені двері в кімнаті#Відображає на карті випадкову кімнату#Знищує усі камені з мітками та камені над криївками#Може відкривати сюжетні двері#Може відобразити {{UltraSecretRoom}} Ультра секретну кімнату"}, -- Cracked Orb
	[676] = {"676", "Порожнє серце", "Якщо на початку нового поверху у вас одне червоне серце чи менше, дає {{EmptyHeart}} порожній контейнер червоних сердець#Ніякого ефекту для персонажів, які не можуть мати червоних сердець"}, -- Empty Heart
	[677] = {"677", "Астральна проекція", "Коли вам завдають шкоди, час зупиняється на 3 секунди#Персонаж стає душею та покидає тіло#У вигляді душі персонаж отримує політ, спектральні сльози та ігнорує перший удар"}, -- Astral Projection
	[678] = {"678", "Кесарів розтин", "{{Chargeable}} Атака зі швидкою зарядкою#Персонаж стріляє самонавідними спектральними зародками, що наносять x2.8 шкоди"}, -- C Section
	[679] = {"679", "Крихітний Абаддон", "{{Collectible399}} Компаньйон, що стріляє мініатюрною атакою Пащі Порожнечі"}, -- Lil Abaddon
	[680] = {"680", "Помста Монтезуми", "{{Chargeable}} Додаткова заряджувана атака Сірчаним лазером, який стріляє з дупи персонажа#Лазер заряджається, поки ви стріляєте"}, -- Montezuma's Revenge
	[681] = {"681", "Крихітний портал", "Компаньйон, що наносить ворогам контактну шкоду і летить в напрямку вашої стрільби#Поглинає розхідники в себе на шляху#Кожен поглинутий розхідник збільшує розміри компаньйона, його шкоду та створює Синю Муху#За кожні 4 розхідники створює портал у не зачищену кімнату"}, -- Lil Portal
	[682] = {"682", "Друг Черв'ячок", "Щупальце, що вилазить з-під землі та хапає ворогів#Спіймані вороги протягом 4 секунд не можуть рухатись, отримують 8 шкоди за секунду та ефект сповільнення"}, -- Worm Friend
	[683] = {"683", "Кісткові шпори", "При смерті вороги створюють 1-2 уламки кісток, що можуть блокувати снаряди та наносять контактну шкоду"}, -- Bone Spurs
	[684] = {"684", "Голодна душа", "Шанс створити привидів при вбивстві ворогів#Привиди переслідують ворогів та наносять контактну шкоду#Контактна шкода за секунду становить х2 шкоди персонажа#Привид вибухає через 5 секунд, наносячи 7 шкоди ворогам поблизу#Вибух не завдає вам шкоди"}, -- Hungry Soul
	[685] = {"685", "Банка вогників", "Створює випадковий вогник, що може стріляти різноманітними слізьми, блокувати ворожі атаки та наносить контактну шкоду#Кількість вогників, яких можна створити за раз, збільшується з кожним використанням предмета й може сягати 12"}, -- Jar of Wisps
	[686] = {"686", "Медальйон душі", "{{SoulHeart}} Перманентне збільшення характеристик за кожне підняте Серце Душі#{{SoulHeart}} Створює 1 Серце Душі"}, -- Soul Locket
	[687] = {"687", "Пошук друзів", "Створює випадкового дружнього монстра, який повторює за персонажем рухи та атаки"}, -- Friend Finder
	[688] = {"688", "Внутрішня дитина", "+1 додаткове життя#Ви воскресаєте в поточній кімнаті з половинкою серця, значно меншими розмірами тіла та збільшеною +0.2 Швидкістю#При воскресінні відбувається кривавий вибух, що наносить 35 шкоди ворогам поблизу"}, -- Inner Child
	[689] = {"689", "Глючна корона", "П'єдестали швидко перемикаються між 5 випадковими предметами"}, -- Glitched Crown
	[690] = {"690", "Желейка", "При зіткненні, вороги відлітають від персонажа#Якщо відкинуті вороги врізаються в перешкоди, стіни чи інших ворогів, вони отримують шкоду#Шкода обчислюється за формулою 8+2*поверх#50% шанс, що персонаж проігнорує контактну шкоду#50% шанс, що ворожий снаряд відскочить від персонажа без нанесення шкоди"}, -- Belly Jelly
	[691] = {"691", "Священна куля", "Предмети з Якістю {{Quality0}}/{{Quality1}} більше не будуть з'являтися#33% шанс зареролити предмети Якості {{Quality2}} в Якість {{Quality3}} або {{Quality4}}"}, -- Sacred Orb
	[692] = {"692", "Кривавий зв'язок", "Створює шипи у кожній {{DevilRoom}}кімнаті Диявола#За отримання шкоди від шипів, ви можете одержати винагороду:#35%: Нічого#33%: ↑ {{Damage}} +0.5 Шкоду збільшено#15%: {{Coin}} 6 монет#10%: {{BlackHeart}} 2 Чорні серця#5%: {{DevilRoom}} Випадковий предмет Диявола#2%: Перетворення в Левіафана"}, -- Sanguine Bond //PERCENTAGES NOT CONFIRMED, updated in patch, taken from Wiki
	[693] = {"693", "Рій", "8 мух-орбіталів, що перетворюються в Синіх мух після блокування ворожого удару#Створює нову муху за кожну зачищену кімнату#Максимум 16 мух-орбіталів"}, -- The Swarm
	[694] = {"694", "Розрив серця", "{{BrokenHeart}} 3 розбиті серця#↑ {{Damage}} +0.25 Шкоди за кожне розбите серце#Кожен смертельний удар додає ще 2 розбиті серця#Ви помрете при 12 розбитих серцях"}, -- Heartbreak
	[695] = {"695", "Кривавий порив", "Коли персонажу завдають шкоди, він отримує бонуси до {{Speed}} Швидкості та {{Tears}} Скорострільності на цілий поверх#Максимум до +1.02 Швидкість та +3 Скорострiльнiсть"}, -- Bloody Gust
	[696] = {"696", "Спасіння", "Аура довкола персонажа#Коли в ауру потрапляють вороги, над ним з'являються промені світла#Якщо ворог пробуде в аурі близько секунди, промінь впаде на нього, наносячи 3.5-152.5 шкоди#Аура росте кожного разу, коли персонажу завдають шкоди на поверсі"}, -- Salvation
	[697] = {"697", "Зникаючий близнюк", "Компаньйон, що стає клоном боса при вході в кімнату боса#Перемога над ним створює додатковий артефакт#Клон та оригінальний бос є повільнішими та мають 75% максимального здоров'я#Не може клонувати міні-босів та фінальних босів, на зразок Мами, Маминого Серця, Айзека, Сатани тощо#Відновлюється на початку наступного поверху"}, -- Vanishing Twin
	[698] = {"698", "Химерна парочка", "Два компаньйони, що літають поруч#Стріляють слізьми з характеристиками та ефектами персонажа, але наносять лише 37.5% від вашої шкоди кожен"}, -- Twisted Pair
	[699] = {"699", "Лють Азазеля", "Лють накопичується за кожну зачищену кімнату#Після 4 кімнат, випускає великий лазер {{Collectible118}} Сірки при вході в наступну кімнату"}, -- Azazel's Rage
	[700] = {"700", "Ехокамера", "Коли персонаж використовує пігулку, карту чи руну, він також використовує копії 3 останніх Пігулок/Рун/Карт, які він застосовував після отримання Ехокамери"}, -- Echo Chamber
	[701] = {"701", "Айзекова могила", "Створює {{DirtyChest}} Стару Скриню, яка відкривається ключем, на початку кожного поверху#Може містити {{SoulHeart}} 1-3 Серця Душі, 3 брелки чи артефакти#Предмети вибираються з пулу {{AngelRoom}} кімнати Ангела, або належать Матусі чи Батьку"}, -- Isaac's Tomb
	[702] = {"702", "Мстивий дух", "Після отримання персонажем шкоди, створює орбітальний вогник, що існуватиме до кінця поверху#Максимум 6 вогників#Вогники стріляють у ворогів, але не блокують їх атаки"}, -- Vengeful Spirit
	[703] = {"703", "Ісав молодший", "Перемикає вашого поточного персонажа на Ісава молодшого й навпаки#У Ісава {{BlackHeart}} 3 Чорні серця, {{Damage}} +2 Шкоди та політ#У персонажів незалежні інвентарі артефактів та здоров'я#При першому використанні, Ісав отримує випадкові пасивні артефакти, відповідно до кількості в основного персонажа#{{Warning}} Смерть за будь-якого з персонажів завершить забіг"}, -- Esau Jr.
	[704] = {"704", "Берсерк!", "При використанні, Ви входите в режим Берсерка на 5 секунд:#↑ {{Speed}} +0.4 Швидкість збільшено#↑ {{Tears}} x0.5 +2 Темп Стрільби#↑ {{Damage}} +3 Шкоду збільшено#Ближній бій#Заряджається при нанесенні шкоди ворогам#Персонаж не може померти, поки ефект Берсерка активний, навіть якщо його здоров'я впало до 0 сердець"}, -- Berserk!
	[705] = {"705", "Темні мистецтва", "При використанні, дає {{Speed}} +1 Швидкість та можливість протягом 1 секунди проходити крізь ворогів та снаряди#Контактна шкода наносить 2x вашої шкоди + 3.5 за кожного зачепленого ворога#Вибух після закінчення ефекту наносить шкоду рівну нанесеній контактній"}, -- Dark Arts
	[706] = {"706", "Безодня", "Поглинає усі предмети в кімнаті та створює атакуючу муху-компаньйона за кожен#Ефекти мух залежать від поглинутих артефактів"}, -- Abyss
	[707] = {"707", "Вечеря", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Вiдновлює 1 Червоне Серце"}, -- Supper
	[708] = {"708", "Степлер", "↑ {{Damage}} +1 Шкоду збільшено#Персонаж стріляє слізьми тільки з одного ока"}, -- Stapler
	[709] = {"709", "Суплекс!", "Персонаж здійснює ривок, під час якого піднімає ворогів чи босів у себе на шляху, а тоді кидає їх на землю#Кидком можна керувати#Кидок створює хвилю з каміння та наносить 50 +/-10 шкоди за кожне збільшення чи зменшення розмірів персонажа"}, -- Suplex!
	[710] = {"710", "Сумка для рукоділля", "Збирає та зберігає в собі до 8 розхідників, які звідти не можна викинути#Коли сумка повна, застосуйте її ще раз, щоб створити предмет#Якість предмета залежить від якості розхідників"}, -- Bag of Crafting
	[711] = {"711", "Перевернись", "В артефакта, згенерованого при вході в кімнату, позаду з'являється другий напівпрозорий предмет#При використанні, міняє справжній та напівпрозорий артефакти місцями#Можна взяти обидва предмети, якщо активувати \"Перевернись\" після підняття першого#!!! Напівпрозорий артефакт зникне, якщо ви піднімете перший предмет та покинете кімнату"}, -- Flip
	[712] = {"712", "Лемеґетон", "Створює орбітального вогника з ефектом пасивного предмета#Вогник може бути знищеним#Предмети мають 25% шанс бути з пулу поточної кімнати, або з пулів Скарбниці, Магазину чи кімнати боса"}, -- Lemegeton
	[713] = {"713", "Сумпторіум", "Забирає у персонажа половинку серця та створює компаньйона у вигляді згустку#Кожен вид сердець створює Згустки з різними характеристиками"}, -- Sumptorium
	[714] = {"714", "Виклик", "Повертає тіло Забутого з будь-якої відстані"}, -- Recall
	[715] = {"715", "Притримай", "Зберігає всередині одну какашкову бомбу, яку можна застосувати пізніше"}, -- Hold (тільки для Tainted ???)
	[716] = {"716", "Мішок Хранителя", "Створює {{Coin}} 3 випадкові монети та {{Key}} 1 ключ#{{Shop}} За кожні 3 монети, витрачені на покупки, ви отримаєте:#↑ {{Damage}} +0.5 Шкоду збільшено#↑ {{Range}} +0.25 Дальнiсть збільшено#↑ {{Speed}} +0.03 Швидкість збільшено"}, -- Keeper's Sack
	[717] = {"717", "Рідня Хранителя", "Камені та вази створюють 0-2 синіх павуків при знищенні#У ворожих кімнатах камені можуть раптово створювати синіх павуків"}, -- Keeper's Kin
	[718] = {"718", "Мотузка Хранителя (Вирізано)", "<Item does not exist>"}, -- Keepers Rope (Cut item)
	[719] = {"719", "Коробка Хранителя", "{{Shop}} Створює на продаж випадковий розхідник чи предмет з пулу магазину"}, -- Keeper's Box
	[720] = {"720", "Банка всього", "Створює певні розхідники залежно від кількості зарядів#При повній зарядці, активує один з випадкових сильних ефектів#Нагороди за рівні зарядки:#{{Blank}} 1:{{PoopPickup}} 2:{{Coin}} 3:{{Bomb}} 4:{{Key}}#{{Blank}} 5:{{Heart}} 6:{{Pill}} 7:{{Card}} 8:{{SoulHeart}}#{{Blank}} 9:{{GoldenHeart}} 10:{{GoldenKey}} 11:{{GoldenBomb}}"}, -- Everything Jar
	[721] = {"721", "ТМТРЕЙНЕР", "Всі наступні предмети будуть 'заглючені'#Випадкові ефекти для 'заглючених' предметів"}, -- TMTRAINER
	[722] = {"722", "Аніма Сола", "Заковує найближчого ворога на 5 секунд, не даючи йому рухатись"}, -- Anima Sola
	[723] = {"723", "Кубик прокрутки", "Реролить всі предмети в кімнаті, зменшуючи їх ID на одиницю"}, -- Spindown Dice
	[724] = {"724", "Гіперкоагуляція", "{{Heart}} Коли ворог завдає вам шкоди, створює половинку або ціле червоне серце#Створені серця відлітають від персонажа та зникають через 1.5 секунди"}, -- Hypercoagulation
	[725] = {"725", "СПК", "Після нанесення певної кількості шкоди, персонаж починає червоніти#Відпустіть кнопки стрільби, щоб активувати один з випадкових ефектів {{Player25}}Гнилого ???:#Кинути випадкову какашку#Розлити слизьку рідину#Випустити отруйний газ#Поставити під собою 5 підпалених бомб"}, -- IBS
	[726] = {"726", "Кровохаркання", "Натисніть на кнопку стрільби двічі, щоб відхаркнути кров#Наносить 150% вашої шкоди ворогам перед вами#1 секунда затримки між харканням#{{BrimstoneCurse}} Уражені вороги отримують додаткову шкоду від лазерів Сірки"}, -- Hemoptysis
	[727] = {"727", "Бомби-привиди", "{{Bomb}} +5 бомб#Бомби створюють привидів, які наносять контактну шкоду та вибухають через 10 секунд"}, -- Ghost Bombs
	[728] = {"728", "Гелло", "Створює демонічного компаньйона, з'єднаного з персонажем#Відтворює ефекти та характеристики сліз персонажа"}, -- Gello
	[729] = {"729", "Голову з пліч", "Ви кидаєте власною головою, яка наносить контактну шкоду та перетворюється на стаціонарну турель#Тіло не може стріляти#Активуйте предмет ще раз або наступіть на голову, щоб повернути її на плечі"}, -- Decap Attack
	[730] = {"730", "Скляне око", "↑ {{Damage}} +0.75 Шкоду збільшено#↑ {{Luck}} +1 Удачу збільшено"}, -- Glass Eye
	[731] = {"731", "Ячмінь", "!!! Застосовується лише для правого ока#↑ {{Damage}} +28% Шкоду збільшено#↑ {{Range}} +7 Дальнiсть збільшено#↓ {{Shotspeed}} -0.3 Швидкість стрільби знижено"}, -- Stye
	[732] = {"732", "Матусине кільце", "↑ {{Damage}} +1 Шкоду збільшено#{{Rune}} Створює випадкову руну або камінь душі"}, -- Mom's Ring

}
EID:updateDescriptionsViaTable(repCollectibles, EID.descriptions[languageCode].collectibles)


---------- Modifiers ----------

EID.descriptions[languageCode].birthright ={
	{"Ісаак", "", "Предмети на п'єдесталах змінюються щосекунди між 2 варіантами"},
	{"Магдалена", "", "↑ {{Heart}} +1 Контейнер з червоним серцем#{{Heart}} Ліміт сердець збільшено до 18"},
	{"Каїн", "", "↑ {{Luck}} +1 Удачу збільшено#{{ArcadeRoom}} На усіх поверхах з'являтиметься покращена Ігрова Кімната, окрім \"Темної Кімнати\" та \"Скрині\"#Сильно підвищує шанс на виграш {{Collectible46}} Щасливої Ніжки"},
	{"Юда", "", "{{Collectible34}} Книга Беліала стає пасивним предметом, аналогічно до {{Collectible584}} Книги Чеснот#{{Collectible34}} Дає Книгу Беліала, якщо її у вас ще не було#↑ {{Damage}} Бонус до шкоди, отриманий від неї, залежить від кількості зарядів активного предмета#Додаткові ефекти для кожного активного предмета"},
	{"???", "", "Серця Душі, отримані від ефекту збільшення здоров'я, подвоюються"},
	{"Єва", "", "Ефект Вавилонської Повії та Мертва Пташка завжди активні"},
	{"Самсон", "", "Кривава Жага може дати на 4 бонуси до шкоди більше, з тим же +0.2 інтервалом, з новим максимумом +14"},
	{"Азазель", "", "Лазер Сірки Азазеля стає набагато ширшим, як у Мега Заряду#Не впливає на шкоду"},
	{"Лазар", "", "Кожного разу, коли Лазар відновлюється як Воскреслий Лазар:#↑ {{Damage}} +7.2 Шкоду збільшено#Бонус до шкоди повільно зникає протягом 1 хвилини#Вбивство ворогів подовжує ефект"},
	{"Едем", "", "Створює 3 випадкові предмети з випадкового пулу предметів#Можна взяти лише один"},
	{"Загублений", "", "З пулів предметів зникають ті, які дають політ, спектральні сльози, бонуси до здоров'я або активуються при отриманні шкоди"},
	{"Воскреслий Лазар", "", "↑ {{Damage}} +7.2 Шкоду збільшено#Бонус до шкоди повільно зникає протягом 1 хвилини#Вбивство ворогів подовжує ефект#Цей ефект спрацьовує при кожному воскресінні Лазаря"},
	{"Темний Юда", "", "{{Collectible34}} Книга Беліала стає пасивним предметом, аналогічно до {{Collectible584}} Книги Чеснот#{{Collectible34}} Дає Книгу Беліала, якщо її у вас ще не було#↑ {{Damage}} Бонус до шкоди, отриманий від неї, залежить від кількості зарядів активного предмета#Додаткові ефекти для кожного активного предмета"},
	{"Ліліт", "", "Компаньйони розміщуються перед обличчям Ліліт"},
	{"Хранитель", "", "↑ +1 Контейнер#Збільшує ліміт здоров'я на 1"},
	{"Аполліон", "", "{{Collectible477}} При активації Пустоти, є шанс появи предмету, який був раніше поглинутий#Характеристики не зменшуються#Чим більше предметів було поглинуто, тим більший шанс на появу артефакту"},
	{"Забутий", "", "Душа більше не прикована до тіла і може вільно рухатись"},
	{"Душа Забутого", "", "Душа більше не прикована до тіла і може вільно рухатись"},
	{"Бетані", "", "Активація предметів з допомогою зарядів душі деколи безкоштовна"},
	{"Яків", "", "Персонаж, який піднімає артефакт, отримує копії 3 пасивних артефактів іншого персонажа"},
	{"Ісав", "", "Персонаж, який піднімає артефакт, отримує копії 3 пасивних артефактів іншого персонажа"},
	{"Гнилий Ісаак", "", "4 додаткові місця для пасивних предметів#Сам не займає місця в інвентарі"},
	{"Гнила Магдалена", "", "{{Heart}} 1 додатковий контейнер Червоного серця, який не може бути спустошеним"},
	{"Гнилий Каїн", "", "Подвоєна кількість розхідників, які з'являються при підборі артефактів"},
	{"Гнилий Юда", "", "{{Collectible705}} Збільшує дальність ураження ворогів та сліз Темними Мистецтвами"},
	{"Гнилий ???", "", "{{PoopPickup}} Збільшує максимальну кількість утримуваних какашок до 29"},
	{"Гнила Єва", "", "Червоні згустки при смерті створюють червоні серця, які зникають через 2 секунди"},
	{"Гнилий Самсон", "", "Ефект Берсерка активується на 3 секунди, замість 1, коли Гнилий Самсон вбиває ворога"},
	{"Гнилий Азазель", "", "{{Collectible726}} Подвоює розмір атаки Кровохаркання"},
	{"Гнилий Лазар", "", "Інша версія Г. Лазаря буде доступна у вигляді привида#Привид імунний до шкоди, але може стріляти#Обидва персонажі отримують ефект Права Первородства"},
	{"Гнилий Едем", "", "Пасивні та активні предмети, підібрані перед Правом Первородства не будуть зареролені при отриманні шкоди#Якщо ви викинете і піднімете активний артефакт, захист на нього не поширюватиметься"},
	{"Гнилий Загублений", "", "Додаткове життя# Г. Загублений відроджується у тій же кімнаті та наносить 200 шкоди найближчим ворогам#Може кілька разів нанести шкоду одному ворогу"},
	{"Гнила Ліліт", "", "{{Collectible728}} Компаньйони поводяться як Гелло#Контактні атаки Гелло наносять на 3 шкоди більше за кожного компаньйона"},
	{"Гнилий Хранитель", "", "Сильно притягує монетки, які випали при вбивстві ворогів на коротких дистанціях#Не впливає на інші монети"},
	{"Гнилий Аполліон", "", "Допоки ви тримаєте кнопки стрільби, сарана буду продовжувати наносити шкоду ворогам, замість повернення"},
	{"Гнилий Забутий", "", "{{Collectible714}} Гнила Душа отримує активний предмет Виклику, щоб повертати Тіло назад до Душі"},
	{"Гнила Бетані", "", "Створює 4 випадкові вогники предметів з Якістю {{Quality3}} і {{Quality4}} зі збільшеним здоров'ям"},
	{"Гнилий Яків", "", "Темний Ісав роздвоюється, створюючи копію-тінь#Обидва Ісави завжди атакують одночасно#{{Collectible722}} Використання Аніма Сола заковує обох Ісавів"},
	{"Мертвий Гнилий Лазар", "", "Інша версія Г. Лазаря буде доступна у вигляді привида#Привид імунний до шкоди, але може стріляти#Обидва персонажі отримують ефект Права Первородства"},
	{"Гнилий Яків 2", "", "Темний Ісав роздвоюється, створюючи копію-тінь#Обидва Ісави завжди атакують одночасно#{{Collectible722}} Використання Аніма Сола заковує обох Ісавів"},
	{"Гнила Душа Забутого", "", "{{Collectible714}} Гнила Душа отримує активний предмет Виклику, щоб повертати Тіло назад до Душі"},
}

-- Buffs caused by Binge Eater
-- Note: "#" will be replaced with "#{{Collectible664}} " automatically, in order to add Binge eater icon infront of each buff-bulletpoint

EID.descriptions[languageCode].bingeEaterBuffs = {
	[22] = "↑ {{Tears}} +0.5 Темп Стрiльби збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- Lunch
	[23] = "↑ {{Tears}} +0.5 Темп Стрiльби збільшено#↑ {{Shotspeed}} +0.2 Швидкість стрільби збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- Dinner
	[24] = "↑ {{Damage}} +1 Шкоду збільшено#↑ {{Shotspeed}} +0.2 Швидкість стрільби збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- Dessert
	[25] = "↑ {{Shotspeed}} +0.2 Швидкість стрільби збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- Breakfast
	[26] = "↑ {{Damage}} +1 Шкоду збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- Rotten Meat
	[456] = "↑ {{Damage}} +1 Шкоду збільшено#↑ {{Luck}} +1 Удачу збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- Midnight Snack
	[346] = "↑ {{Shotspeed}} +0.2 Швидкість стрільби збільшено#↑ {{Luck}} +1 Удачу збільшено#↓ {{Speed}} -0.03 Швидкість зменшено", -- A Snack
	[707] = "↑ {{Tears}} +0.5 Темп Стрiльби збільшено#↑ {{Luck}} +1 Удачу збільшено#↓ -0.03 Швидкість зменшено", -- Supper
}

-- Buffs caused by Book of Belial with Judas' Birthright
-- Note: "#" will be replaced with "#{{Collectible34}} " automatically, in order to add Book of Belial icon infront of each buff-bulletpoint

EID.descriptions[languageCode].bookOfBelialBuffs = {
	[40] = "Також активує ефект {{Collectible35}}Некрономікону", -- Kamikaze!
	[126] = "Також активує ефект {{Collectible35}}Некрономікону", -- Razor Blade
	[127] = "↑ {{Damage}} +2 Шкоди на весь наступний поверх", -- Forget me Now
	[133] = "↑ {{Damage}} +0.5 Шкоду збільшено", -- Guppy's Paw
	[135] = "Тимчасово ↑ {{Damage}} збільшує шкоду на +0.66 при кожному використанні", -- IV Bag
	[147] = "У Кайла збільшується запас міцності та відштовхування#Можна використовувати частіше, підпалює ворогів і дозволяє отримати більше розхідників при знищенні купок лайна та інших перешкод", -- Notched Axe
	[186] = "Також активує ефект {{Collectible126}}Леза Бритви", -- Blood Rights
	[282] = "Залишає слід з вогню, який наносить контактну шкоду та підпалює ворогів", -- How to Jump
	[290] = "Витрачає одне серце за раз, збільшуючи шкоду та залишаючи кривавий слід на підлозі", -- The Jar
	[295] = "Шанс на активацію ефекту {{Collectible555}}Золотої Бритви", -- Magic Fingers
	[297] = "Окрім стандартного ефекту, створює демонічного компаньйона", -- Pandora's Box
	[323] = "Випущені сльози є спектральними та наносять більше шкоди", -- Isaac's Tears
	[326] = "Замість сворення світла, персонаж має вогняну ауру, допоки невразливий#Тимчасове збільшення Шкоди та активація ефекту {{Collectible35}}Некрономікона при ідеальному блоці", -- Breath of Life
	[352] = "Активує ефект Книги Беліала, коли розбивається -  шкоду збільшено до моменту відновлення Скляної Гармати", -- Glass Cannon
	[475] = "Відновлює Вас при смерті як Темного Юду, якщо є додаткове життя", -- Plan C
	[482] = "Замінює останній отриманий артефакт на {{Collectible51}}Пентаграму", -- Clicker
	[487] = "Перманентно ↑ {{Damage}} +0.5 Шкоди при використанні", -- Potato Peeler
	[536] = "Тимчасово збільшує шкоду на +10.8 за кожного принесеного в жертву компаньйона#Шкода повільно повертається до норми, аналогічно до ефекту {{Collectible621}}Червоного Рагу", -- Sacrificial Altar
	[555] = "Наносить шкоду всім ворогам в кімнаті і накладає на них ефект {{Collectible202}}Дотику Мідаса", -- Golden Razor
	[577] = "Перманентне збільшення шкоди", -- Damocles
	[582] = "Додатково збільшує шкоду для поточного поверху на +0.2 за кожне використання", -- Wavy Cap
	[585] = "Змінює нагороду на 2 Чорні Серця та 1 предмет Диявольської Угоди#3 серця та 2 предмети, якщо була угода з Дияволом", -- Alabaster Box
	[622] = "Безкоштовна {{Collectible51}}Пентаграма", -- Genesis
	[623] = "Також активує ефект {{Collectible126}}Леза Бритви", -- Sharp Key
	[635] = "Створює лінію {{Collectible705}}Темних Мистецтв між персонажем та Стібком", -- Stitches
	[640] = "Випускає лазер {{Collectible118}}Сірки замість полум'я", -- Urn of Souls
	[642] = "↑ {{Damage}} x1.4 множник шкоди#↑ {{Damage}} +1 Шкоду збільшено", -- Magic Skin
	[653] = "Привиди будуть наводитись на ворогів", -- Vade Retro
	[685] = "Створює вогник {{Collectible292}}Сатанинської Біблії, який збільшує шанс на угоду з Дияволом", -- Jar of Wisps
	[705] = "Дозволяє отримувати тимчасові бонуси до шкоди за кожне влучання у ворога/снаряд під ефектом Темних Мистецтв", -- Dark Arts
	[710] = "Шанс, що Червоні серця при підйомі будуть замінені на Чорні", -- Bag of Crafting
	[729] = "Поки голова від'єднана':#↑ {{Tears}} x3 множник темпу стрільби#↑ {{Damage}} +2 Шкоду збільшено", -- Decap Attack
}

-- Book of Virtues wisp types
EID.descriptions[languageCode].bookOfVirtuesWisps = {
	[33] = "Самонавідні сльози", -- The Bible
	[34] = "Подвоєна шкода від сліз", -- The Book of Belial
	[35] = "3.5% шанс на Сльозу страху#Ефект Некрономікону при знищенні", -- The Necronomicon
	[36] = "2.5% шанс на Сльозу з ефектом Кишкової Палички", -- The Poop
	[37] = "Створює дрібні бомбочки при знищенні", -- Mr. Boom
	[38] = "Швидкі, але неточні сльози", -- Tammy's Head
	[39] = "5% шанс паралізувати ворога сльозою", -- Mom's Bra
	[40] = "Вибухові сльози#Вибухає при знищенні", -- Kamikaze!
	[41] = "7.5% шанс на Сльозу страху", -- Mom's Pad
	[42] = "7.5% шанс на сльозу Іпекаку", -- Bob's Rotten Head
	[44] = "10% шанс, що сльози телепортують ворогів у випадкове місце#Вогники мигають кожні 5 секунд", -- Teleport!
	[45] = "20% шанс, що ворог загубить серце при смерті", -- Yum Heart
	[47] = "Сльози наносять половину шкоди#Усі вогники з Пульта Лікаря випускають по 3 вибухові сльози в сторону хрестика", -- Doctor's Remote
	[49] = "Не може стріляти#Усі вогники від Шуп-да-Вуп! стріляють лазерами при використанні", -- Shoop da Whoop!
	[56] = "Швидка стрільба, але низька дальність#Вогники залишають жовті калюжі", -- Lemon Mishap
	[58] = "Імунітет до ворожих снарядів", -- Book of Shadows
	[65] = "Створює Троль-бомбу при знищенні", -- Anarchist Cookbook
	[66] = "Сповільнює ворогів на 3 секунди при знищенні", -- The Hourglass
	[77] = "Додаткова контактна шкода", -- My Little Unicorn
	[78] = "Не може стріляти#Створює компаньйона з 7 Печатей на одну кімнату при знищенні", -- Book of Revelations
	[83] = "Відштовхувальні сльози", -- The Nail
	[84] = "Без додаткових ефектів", -- We Need to Go Deeper!
	[85] = "Створює карту при знищенні", -- Deck of Cards
	[86] = "Сльози-зуби", -- Monstro's Tooth
	[93] = "Антигравітаційні сльози#Шанс на Сльози страху", -- The Gamekid
	[97] = "Створює 1 з 8 вогників: {{Collectible65}}{{Collectible42}}{{Collectible85}}{{Collectible102}}{{Collectible37}}{{Collectible177}}{{Collectible49}}{{Collectible45}}", -- The Book of Sin
	[102] = "Створює 1 з 6 кольорових вогників з випадковими ефектами для кожного забігу#Шанс на сльозу з ефектом Отрути, Паралічу, Розгубленості, Вогню, Троль-бомбових сліз, або появи ворожого павука при знищенні#Створює випадкову пігулку при знищенні", -- Mom's Bottle of Pills
	[105] = "Створює додатковий вогник для кожного рерольнутого предмета", -- The D6
	[107] = "Пронизуючі сльози", -- The Pinking Shears
	[111] = "Створює хмарку отруйного газу при знищенні", -- The Bean
	[123] = "Випадкові сльози", -- Monster Manual
	[124] = "Створює вогник з ефектом предмету, який наслідує", -- Dead Sea Scrolls
	[126] = "Вогник зі збільшеним здоров'ям", -- Razor Blade
	[127] = "Безсмертний вогник для нового поверху", -- Forget Me Now
	[130] = "Не може стріляти#Вогник летить в напрямку стрільби", -- A Pony
	[133] = "3 вогники зі збільшеним здоров'ям", -- Guppy's Paw
	[135] = "Без додаткових ефектів", -- IV Bag
	[136] = "7.5% шанс на сльозу з ефектом Гнилого Томата#Уражені вороги будуть атаковані іншими ворогами", -- Best Friend
	[137] = "1 вогник за кожну підірвану бомбу#Сльози вогника також можна дистанційно підірвати", -- Remote Detonator
	[145] = "Вогники з'являються замість мух#Створює мух при знищенні", -- Guppy's Head
	[146] = "Самонавідні сльози", -- Prayer Card
	[147] = "При знищенні каменів може з'явитися випадковий 1 з 5 вогників-матеріалів#Шанс на сльози з ефектом Вугілля, Розгубленості, Монетки, Подвоєної шкоди, Лазерів", -- Notched Axe
	[158] = "Швидкі сльози з наведенням в найближчих ворогів", -- Crystal Ball
	[160] = "Створює промені світла при контакті", -- Crack the Sky
	[164] = "Вогник на 1 кімнату", -- The Candle
	[166] = "Знищує усі розхідники з шансом створити по вогнику за кожен", -- D20
	[171] = "7.5% шанс на сповільнювальні сльози", -- Spider Butt
	[175] = "Вогник дотиком відкриває закриті скрині та двері, включно з дверима до Мега Сатани, Підйому та Трупу", -- Dad's Key
	[177] = "Створює вогник залежно від виграшу", -- Portable Slot
	[181] = "10% шанс на сльози Святого Світла", -- White Pony
	[186] = "Вогник зі збільшеним здоров'ям", -- Blood Rights
	[192] = "Самонавідні сльози", -- Telepathy for Dummies
	[263] = "15% шанс, що з ворога випаде випадкова руна#Створює руну при знищенні", -- Clear Rune
	[282] = "До 6 нерухомих вогників", -- How to Jump
	[283] = "Реролить ваших вогників, при цьому створює ще одного#Не реролить Книгу Чеснот", -- D100
	[284] = "Знищує усі вогники і дає по вогнику за кожні 2 артефакти в інвентарі#Не реролить Книгу Чеснот", -- D4
	[285] = "10% шанс спрацьовування ефекту D10 при ударі", -- D10
	[286] = "15% шанс, що з ворога випаде випадкова карта#Створює картку при знищенні", -- Blank Card
	[287] = "Ефект Розбитої Кулі при знищенні", -- Book of Secrets
	[288] = "Вогники з'являються замість павуків#Створює синього павука при знищенні", -- Box of Spiders
	[289] = "Вогник на 1 кімнату#Стріляє червоним вогнем", -- Red Candle
	[290] = "Замість ефекту, створює вогник за кожне серце#Шанс на половинку серця при знищенні", -- The Jar
	[291] = "Створює додатковий вогник за кожного ворога, перетвореного в купку лайна", -- Flush!
	[292] = "+10% шанс на кімнату {{DevilRoom}}Диявола чи {{AngelRoom}}Ангела за кожен вогник Сатанинської біблії", -- Satanic Bible
	[293] = "Стріляє 4-стороннім лазером при знищенні", -- Head of Krampus
	[294] = "Вогник на 1 кімнату#Не може стріляти#Ефект Масляного боба при знищенні", -- Butter Bean
	[295] = "Шанс на появу випадкової монетки при знищенні", -- Magic Fingers
	[296] = "Без додаткових ефектів", -- Converter
	[297] = "Без додаткових ефектів", -- Pandora's Box
	[298] = "Не може стріляти#Імунітет до контактної шкоди#Наносить шкоду лише при активації Копита Єдинорога", -- Unicorn Stump
	[323] = "Створює 6 вогників на 3 секунди", -- Isaac's Tears
	[324] = "Сльози з ефектом Пластилінового печива", -- Undefined
	[325] = "Випускає град сліз по дузі", -- Scissors
	[326] = "Створює 4 вогники при ідеальному блоці", -- Breath of Life
	[338] = "Вогник на 1 кімнату#Сльози-бумеранги", -- The Boomerang
	[347] = "Сльози з ефектом 20/20#Подвоює інших вогників", -- Diplopia
	[348] = "Створює пігулку при знищенні", -- Placebo
	[349] = "50% шанс створити монетку при знищенні", -- Wooden Nickel
	[351] = "Всі вогники від Мега Бобу створюють кам'яну хвилю при активації артефакта#Параліч + отруйна газова хмарка при знищенні", -- Mega Bean
	[352] = "Усі вогники Скляної Гармати руйнуються при знищенні одного з них", -- Glass Cannon
	[357] = "Дублює ваших вогників для поточної кімнати", -- Box of Friends
	[382] = "Захоплені вороги при смерті створюють вогники з ефектами: нормальний, з самонаведенням, вибуховий чи з лазером Сірки", -- Friendly Ball
	[383] = "Сльози вогників можна підірвати, перетворивши у 6 дрібніших сліз#Випускає град сліз Ісаака при знищенні#Діє між кімнатами", -- Tear Detonator
	[386] = "5% шанс випустити сльозу, яка реролить перешкоди у кімнаті (окрім купок лайна та динаміту) при влучанні", -- D12
	[396] = "Не може стріляти#Біля кожного порталу з'являється 1 вогник", -- Ventricle Razor
	[406] = "Випадкова шкода і скорострільність", -- D8
	[419] = "20% шанс, що випущена сльоза телепортує ворогів#Вогники блимають кожні 5 секунд", -- Teleport 2.0
	[421] = "Причаровувальний газ при знищенні", -- Kidney Bean
	[422] = "30% шанс вистрілити паралізуючими слізьми", -- Glowing Hour Glass
	[427] = "Літає кімнатою, вибухає при влучанні в нього сльози Ісаака#Не може стріляти чи наносити контактну шкоду", -- Mine Crafter
	[434] = "Створює вогники замість мух#На створення 1 вогника може бути використано до 5 мух#Більше мух - сильніший вогник", -- Jar of Flies
	[437] = "Ефект D7 при першому попаданні по вогнику", -- D7
	[439] = "Без додаткових ефектів", -- Mom's Box
	[441] = "Випускає малі лазери Сірки(Заряджуваний)#Усі вогники Мега Заряду безперервно стріляють, поки активований Мега Заряд", -- Mega Blast
	[475] = "8 вогників з високою шкодою", -- Plan C
	[476] = "Створює другий вогник, якщо не було продубльовано жодного розхідника", -- D1
	[477] = "Створює вогники усіх поглинутих активних предметів#Сам не створює вогника", -- Void
	[478] = "Зупиняє усіх ворогів та сльози на 3 секунди при знищенні", -- Pause
	[479] = "Шанс створити брелок при знищенні", -- Smelter
	[480] = "Здоров'я вогника збільшується від кількості знищених розхідників", -- Compost
	[481] = "5% шанс, що сльоза перетворить ворогів у випадкові вогники", -- Dataminer
	[482] = "Створює випадкового вогника", -- Clicker
	[483] = "8 вогників, що створюють Золоті Троль-бомби при знищенні", -- Mama Mega!
	[484] = "Вогник на 1 кімнату#Не може стріляти#Ефект Стривай, Що? при знищенні", -- Wait What?
	[485] = "Усі вогники від Зігнутого Пенні можуть бути знищені або продубльовані, коли одному з них завдадуть шкоди", -- Crooked Penny
	[486] = "Не може стріляти#Шанс, що персонаж проігнорує отримання шкоди", -- Dull Razor
	[487] = "Вічні вогники#Переслідує ворогів та стріляє в них#Не блокує постріли та не наносить контактної шкоди", -- Potato Peeler
	[488] = "Створює вогник того активного предмета, ефект якого копіює (випадкового, якщо нічого не копіює)", -- Metronome
	[489] = "Створює нормальний вогник + вогник з ефектом обраного кубика", -- D Infinity
	[490] = "Створює випадковий вогник#Вогник відновлюється після зачистки кімнати, якщо був знищений", -- Eden's Soul
	[504] = "Вогник на 1 кімнату#Швидко і влучно стріляє в найближчих ворогів", -- Brown Nugget
	[507] = "Шанс створити вогник при вбивстві", -- Sharp Straw
	[510] = "Сльози з ефектом одного з артефактів: Легеня Монстро, Гниле Дитя, Ріжки Локі чи Сірка", -- Delirious
	[512] = "Магнітні сльози", -- Black Hole
	[515] = "Створює випадковий вогник#Вогник відновлюється після зачистки кімнати, якщо був знищений", -- Mystery Gift
	[516] = "Стріляє слізьми у 8 напрямах, як Оприскувач", -- Sprinkler
	[521] = "Потрійний постріл#Усі вогники від Купона знищуються, якщо ви щось купуєте за монети", -- Coupon
	[522] = "Схоплені снаряди перетворюються на вогники", -- Telekinesis
	[523] = "Вогник з'являється лише при викиданні предметів#Створює випадковий розхідник при знищенні", -- Moving Box
	[527] = "Не може стріляти#При зачистці кімнати, вогник відкриває скрині та двері", -- Mr. ME!
	[536] = "Перетворює кожен вогник в половинку серця#Створює сильного вогника при жертвопринесенні", -- Sacrificial Altar
	[545] = "Створює дружнього Боні при знищенні", -- Book of the Dead
	[550] = "10% шанс, що сльоза спровокує удар ноги по ворогу", -- Broken Shovel
	[552] = "10% шанс, що сльоза спровокує удар ноги по ворогу#Також створює вогник з високим здоров'ям, який не може стріляти", -- Mom's Shovel
	[555] = "15% шанс на сльозу з ефектом Дотику Мідаса", -- Golden Razor
	[556] = "Лазерні сльози з низькою дальністю", -- Sulfur
	[557] = "+0.2 Удачі за кожен вогник Печива з Передбаченнями", -- Fortune Cookie
	[577] = "Без додаткових ефектів", -- Damocles
	[578] = "Вогник залишає за собою жовтий слід", -- Free Lemonade
	[580] = "Шанс створити Червоні Двері при вході в нову кімнату", -- Red Key
	[582] = "Максимум 1 вогник Хвилястої Шапочки", -- Wavy Cap
	[584] = "Ніякої користі від кількох копій", -- Book of Virtues
	[585] = "8 вогників", -- Alabaster Box
	[604] = "Вогник на 1 кімнату#3 вогники з'являються у місці, де приземляється кинутий об'єкт#10% шанс на сльози розгубленості", -- Mom's Bracelet
	[605] = "Без додаткових ефектів", -- The Scooper
	[609] = "Невразливий вогник#50% шанс, що усі вогники Вічного D6 будуть знищені при використанні", -- Eternal D6
	[611] = "Здоров'я і шкода збільшуються залежно від заряду", -- Larynx
	[622] = "3 вогники#Знищує усі інші вогники", -- Genesis
	[623] = "Без додаткових ефектів", -- Sharp Key
	[631] = "Роздвоює вогники, при цьому ділячи їх здоров'я та шкоду навпіл#Вогники знищуються при третьому поділі", -- Meat Cleaver
	[635] = "Залишає нерухомий вогник#До 6 нерухомих вогників", -- Stitches
	[636] = "Без вогників", -- R Key
	[638] = "Стирає ворогів не-босів при дотику", -- Eraser
	[639] = "Не може стріляти#Створює синю муху при зачистці кімнати", -- Yuck Heart
	[640] = "Шанс на постріл синім вогнем", -- Urn of Souls
	[642] = "Отруйні сльози", -- Magic Skin
	[650] = "Коли Сливова Крихітка летить по діагоналі, усі вогники Сливової Флейти повторюють її рухи", -- Plum Flute
	[653] = "Без вогників#Червоні привиди можуть стріляти", -- Vade Retro
	[655] = "Вогники тільки на час активації предмета", -- Spin to Win
	[685] = "Подвоює всі наявні вогники та створює ще 1", -- Jar of Wisps
	[687] = "Створює випадковий вогник", -- Friend Finder
	[703] = "Без додаткових ефектів", -- Esau Jr.
	[704] = "Вогник зі збільшеним здоров'ям#Не може стріляти", -- Berserk
	[705] = "Вогник на 1 кімнату за кожного вбитого ворога", -- Dark Arts
	[706] = "Вогник зі збільшеним здоров'ям#Не може стріляти", -- Abyss
	[709] = "Вогник на 1 кімнату#3 вогники з'являються на місці вашого приземлення", -- Suplex
	[710] = "Створює випадковий вогник при виготовленні", -- Bag of Crafting
	[711] = "Без додаткових ефектів", -- Flip
	[712] = "Вогники-предмети стріляють самонавідними слізьми", -- Lemegeton
	[713] = "Без вогників", -- Sumptorium
	[719] = "20% шанс, що при смерті з ворога випаде монета", -- Keeper's Box
	[720] = "Створює випадковий вогник", -- Everything Jar
	[722] = "Вогник кружляє довкола скованого ворога, стріляючи в нього#Зникає при смерті ворога", -- Anima Sola
	[723] = "Реролить ваші вогники в один тип", -- Spindown Dice
	[728] = "Усі вогники кружляють довкола Гелло", -- Gello
	[729] = "Нерухомий вогник", -- Decap Attack

}

-- Special Locust effects when Item was eaten by Abyss
EID.descriptions[languageCode].abyssSynergies = {
	[2] = "Три стандартні Сарани", -- The Inner Eye
	[3] = "Фіолетова самонавідна Сарана", -- Spoon Bender
	[4] = "Червона велика Сарана, що наносить потрійну шкоду", -- Cricket's Head
	[6] = "Жовта швидка Сарана з невеликою дальністю, яка наносить шкоду швидше", -- Number One
	[7] = "Червона Сарана, що наносить подвійну шкоду", -- Blood of the Martyr
	[10] = "Дві сірі Сарани, що наносять половину шкоди", -- Halo of Flies
	[13] = "Зелена Сарана, що отруює ворогів", -- The Virus
	[103] = "Зелена Сарана, що отруює ворогів", -- The Common Cold
	[118] = "Велика сіра стандартна Сарана", -- Brimstone
	[149] = "Велика, повільна, зелена Сарана, що наносить x1.5 вашої шкоди і отруює ворогів", -- Ipecac
	[153] = "Чотири стандартні Сарани", -- Mutant Spider
	[257] = "Оранжева, палаюча Сарана, що підпалює ворогів", -- Fire Mind
	[305] = "Зелена Сарана, що отруює ворогів", -- Scorpio
	[374] = "Бірюзова світлова Сарана, що створює Промені світла, які наносять х3 вашої шкоди", -- Holy Light
	[494] = "Блакитна Сарана з електричними дугами, які наносять 0.1 шкоди за ігровий тік", -- Jacob's Ladder
	[559] = "Блакитна Сарана з електричними дугами, які наносять 0.1 шкоди за ігровий тік", -- 120 Volt
}

-- Effect of Car battery on Active Items
local repCarBattery = {
	[323] = "Випущені сльози наносять подвійну шкоду", -- Isaac's Tears
	[421] = "", -- Kidney Bean, подвійну шкоду видалено в Rep
	[489] = "Активує ефект вибраного кубика двічі", -- D Infinity
	[523] = "", -- Moving Box, механіку свапу було видалено в Rep
	[556] = "Подвійний лазер Сірки, що наносить збільшену шкоду", -- Sulfur
	[584] = "Подвоює кількість вогників", -- Book of Virtues
	[605] = "Створює двох Споглядачів. Шкода збільшується лише один раз", -- The Scooper
	[609] = "Шанс втрати п'єдестального предмета збільшений вдвічі", -- Eternal D6
	[625] = "Ефект діє 60 секунд", -- Mega Mush
	[705] = "Ефект триває 2 секунди", -- Dark Arts
	[720] = "Створює купку лайна поруч з розхідником", -- Everything Jar
	[723] = "Зменшує ID предмета на 2", -- Spindown Dice
}
--EID.descriptions[languageCode].carBattery[284] = nil -- D4
EID:updateDescriptionsViaTable(repCarBattery, EID.descriptions[languageCode].carBattery)

---------- Trinkets ----------

local repTrinkets={
	[1] = {"1", "Проковтнутий пенні", "{{Coin}} Ви отримуєте 1 монету при отриманні шкоди#{{Player14}} 0-1 за персонажа 'Хранитель'"}, -- Swallowed Penny
	[10] = {"10", "Хвилястий черв", "Сльози рухаються хвилями#↑ {{Tears}} +0.4 Темп Стрільби збiльшено#Спектральні сльози"}, -- Wiggle Worm
	[11] = {"11", "Кільчастий черв", "Сльози рухаються кільцями#↑ {{Tears}} +0.47 Темп Стрільби збiльшено#Спектральні сльози"}, -- Ring Worm
	[15] = {"15", "Щасливий камінь", "{{Coin}} 33% шанс отримати монету при знищенні каменів"},-- Lucky Rock
	[16] = {"16", "Матусин ніготь", "Матусина Нога тупає у випадковому місці в кімнаті кожні 20 секунд"}, -- Mom's Toenail
	[23] = {"23", "Загублений плакат", "{{Player10}} Відродження за персонажа 'Загублений'#Якщо він ще не відкритий, то помріть у {{SacrificeRoom}} кімнаті жертвопринесень, маючи цей брелок при собі#{{Player31}} Гнилий 'Загублений' відроджує самого себе"}, -- Missing Poster
	[24] = {"24", "Дуповий пенні", "{{Coin}} +20% шанс на випадіння монети з купки лайна#Ви пукаєте, коли підбираєте монету#{{Poison}} Ваш пук відштовхує і отруює ворогів"}, -- Butt Penny
	[26] = {"26", "Гаковий черв", "Сльози рухаються кутовими рухами#↑ {{Tears}} +0.4 Темп Стрільби збільшено#↑ {{Range}} +1.5 Дальнiсть збiльшено#Спектральні сльози"}, -- Hook Worm
	[32] = {"32", "Шапка свободи", "25% шанс на випадковий ефект гриба на 1 кімнату"}, -- Liberty Cap
	[33] = {"33", "Пуповина", "Коли у вас залишається половина серця, або менше, ви отримуєте компаньйона {{Collectible100}} Маленький Стівен#{{Collectible318}} Високий шанс отримати \"Близнюка\" при отриманні шкоди"}, -- Umbilical Cord
	[39] = {"39", "Рак", "↑ {{Tears}} +1 Темп Стрільби збільшено"},
	[48] = {"48", "Загублена сторінка", "Коли ви отримуєте шкоду, є шанс нанести 80 шкоди усім ворогам у кімнаті#{{Collectible35}} Шкода від чорних сердець і некрономікону подвоюється"}, -- A Missing Page
	[49] = {"49", "Кривавий пенні", "{{HalfHeart}} 25% шанс отримати половинку червоного серця при піднятті монети"}, -- Bloody Penny
	[50] = {"50", "Спалений пенні", "{{Bomb}} 25% шанс отримати бомбу при піднятті монети"}, -- Burnt Penny
	[51] = {"51", "Плаский пенні", "{{Key}} 25% шанс отримати ключ при піднятті монети"}, -- Flat Penny
	[65] = {"65", "Стрічковий черв", "↑ {{Range}} +3 Дальнiсть збільшено"}, -- Tape Worm
	[66] = {"66", "Лінивий черв", "↓ {{Shotspeed}} -0.5 Швидкість Стрільби зменшено"}, -- Lazy Worm
	[67] = {"67", "Розбитий ігровий кубик", "При отриманні персонажем шкоди, з 50% шансом активується один з ефектів кубиків:#{{Collectible105}} D6#{{Collectible406}} D8#{{Collectible285}} D10#{{Collectible386}} D12#{{Collectible166}} D20"}, -- Cracked Dice
	[69] = {"69", "Вицвілий полароїд", "Маскує вашого персонажа#Збиває з пантелику ворогів#Можна використати, щоб відчинити двері у 'Дім'"}, -- Faded Polaroid
	[80] = {"80", "Чорне Перо", "↑ {{Damage}} +0.5 Шкоди за кожен 'Злий' предмет"}, -- Black Feather
	[92] = {"92", "Зламана корона", "↑ Підвищення характеристик від предмету на 20% ефективніше"}, -- Cracked Crown
	[96] = {"96", "Черв'як Уроборос", "Сльози рухаються по спіралі#↑ {{Tears}} +0.4 Темп Стрiльби збільшено#↑ {{Range}} +1.5 Дальність збільшено#Спектральні сльози#Шанс на самонавідні сльози"}, -- Ouroboros Worm
	[98] = {"98", "Ніс гобліна", "{{Poison}} 5% шанс вистрілити самонавідними отруйними  липкими сльозами#Наносить таку ж шкоду як ваші сльози#Прикріплюється до ворога на 10 секунд"},
	[101] = {"101", "Згасла лампа", "!!! Поки ви тримаєте повністю розряджений активний артефакт:#↑ {{Damage}} +1.5 Шкоду збільшено#↑ {{Speed}} +0.5 Швидкість збільшено#↑ {{Range}} +1.5 Дальнiсть збільшено#↑ {{Tears}} +0.5 Темп Стрільби збільшено#↑ {{Shotspeed}} +0.3 Швидкість Стрільби збільшено#↑ {{Luck}} +2 Удачу збільшено"},
	[107] = {"107", "Серце Ворона", "Ви у першу чергу втрачаєте червоні серця, а вже потім інші види сердець #!!! Втрата червоних сердець може знизити ваш шанс на кімнату Диявола/Ангела"}, -- Crow Heart
	[110] = {"110", "Срібний долар", "{{Shop}} Магазини з'являються у 'Матці' і 'Трупі'"},
	[111] = {"111", "Кривава корона", "{{TreasureRoom}} Золоті кімнати з'являються у 'Матці' і 'Трупі'"}, -- Bloody Crown
	[119] = {"119", "Стовбурова клітина", "Заповнює половину порожніх червоних/кісткових сердець при переході на інший поверх#Мінімум половинка серця буде вилікувана"}, -- Stem Cell
	[128] = {"128", "Кістка з пальця", "{{EmptyBoneHeart}} 4% шанс отримати кісткове серце при отриманні шкоди"}, -- Finger Bone
	[129] = {"129", "Щелеполом", "10% шанс вистрілити зубом#Зуб наносить 3.2x вашої шкоди#100% шанс з Удачею 9"}, -- Jawbreaker
	[130] = {"130", "Пожована ручка", "{{Slow}} 10% шанс вистрілити сповільнювальними сльозами#{{Luck}} 100% шанс з Удачею 18"}, -- Chewed Pen
	[131] = {"131", "Благословенний пенні", "{{SoulHeart}} 17% шанс на появу половинки серця Душі при підбиранні монет"}, -- Blessed Penny
	[132] = {"132", "Зламаний шприц", "25% шанс на випадковий ефект шприца на 1 кімнату"}, -- Broken Syringe
	[133] = {"133", "Вкорочений ґніт", "Бомби вибухають значно швидше"}, -- Short Fuse
	[134] = {"134", "Гігантська квасоля", "Збільшує розмір пука"}, -- Gigante Bean
	[135] = {"135", "Запальничка", "{{Burning}} 20% шанс підпалити ворогів при вході в кімнату"}, -- A Lighter
	[136] = {"136", "Зламаний замок", "Двері, замки і золоті скрині тепер можна відчинити вибухівкою#Також можна відкрити двері в 'Дім'"}, -- Broken Padlock
	[137] = {"137", "Міозотія", "При переході на інший поверх, з'являється до 4 предметів з попереднього поверху"}, -- Myosotis
	[138] = {"138", "'M", "При використанні активного артефакта, він замінюється на інший"}, -- 'M
	[139] = {"139", "Сльозо-амулет", "{{Luck}} +4 Удачі для артефактів, ефект яких залежить від неї"}, -- Teardrop Charm
	[140] = {"140", "Яблуко Содому", "Підбирання сердець може конвертувати їх у синіх павуків#Працює навіть при повному ХП#Ефект може забрати серця, які потрібні для зцілення"}, -- Apple of Sodom
	[141] = {"141", "Забута Колискова", "Підвищує швидкострільність компаньйонів"}, -- Forgotten Lullaby
	[142] = {"142", "Віра Бет", "{{Collectible584}} При переході на новий поверх, створює 4 сині вогники з 'Книги чеснот'"}, -- Beth's Faith
	[143] = {"143", "Cтарий конденсатор", "Активний артефакт більше не заряджається після зачищення кімнат#{{Battery}} Натомість, є 20% шанс на випадіння батарейки після зачищення кімнати#{{Luck}} 33% шанс з Удачею 5"}, -- Old Capacitor
	[144] = {"144", "Мозковий черв", "Сльоза може повернутися на 90 градусів"}, -- Brain Worm
	[145] = {"145", "Ідеал", "↑ {{Luck}} +10 Удачу збільшено#Знищується, коли персонаж отримує шкоду"}, -- Perfection
	[146] = {"146", "Корона демона", "{{RedTreasureRoom}} Золоті кімнати мають угоду з дияволом, замість безкоштовного предмету"}, -- Devil's Crown
	[147] = {"147", "Заряджений пенні", "17% шанс зарядити активний артефакт на 1 поділку після підняття монети"}, -- Charged Penny
	[148] = {"148", "Намисто дружби", "Змушує компаньйонів кружляти навколо Ісаака"}, -- Friendship Necklace
	[149] = {"149", "Кнопка тривоги", "Активує ваш активний артефакт при отриманні шкоди"}, -- Panic Button
	[150] = {"150", "Синій ключ", "При вході у кімнату, двері якої відкриваються ключем, ви потрапляєте у кімнату з 'Синьої Матки'#Зачистика цієї кімнати відкриває двері до оригінальної кімнати, в яку ви прямували#Ключі не витрачаються"}, -- Blue Key
	[151] = {"151", "Напилок", "Шипи не наносять вам шкоди# Також діє на{{CursedRoom}}Прокляту кімнату й інші шипові об'єкти"}, -- Flat File
	[152] = {"152", "Лінза телескопа", "{{PlanetariumChance}} +24% до шансу на планетарій, якщо він ще не з'являвся#+9%, якщо він вже з'являвся на попередніх поверхах#Планетарій може з`явитися у локації \"Матка\" і \"Труп\""}, -- Telescope Lens
	[153] = {"153", "Матусин локон", "25% шанс на ефект випадкового артефакту Мами"}, -- Mom's Lock
	[154] = {"154", "Мішок для кубиків", "50% шанс появи випадкового одноразового ігрового кубика при вході у кімнату#Кубик зникає, якщо ви покинете кімнату#Кубик розміщується у слотах для карток/пігулок, при цьому не займаючи сам слот"}, -- Dice Bag
	[155] = {"155", "Свята корона", "Створює {{TreasureRoom}} Золоту Кімнату і {{Shop}} Магазин у 'Соборі'"}, -- Holy Crown
	[156] = {"156", "Матусин цілунок", "{{Heart}} +1 контейнер Червоних сердець, поки ви тримаєте цей брелок#{{Player14}} +1 Контейнер-монета для Хранителя"}, -- Mother's Kiss
	[157] = {"157", "Рвана карта", "Кожні 15 пострілів ви вистрілюєте сльозою з ефектами {{Collectible149}} Іпекака + {{Collectible5}} Мого Відображення"}, -- Torn Card
	[158] = {"158", "Порвана кишеня", "При отримані шкоди, Ісаак губить 2 випадкові розхідники#Розхідники, що випали, можуть змінювати свою варіацію, наприклад звичайний ключ у золотий, звичайна бомба у троль-бомбу і так далі"}, -- Torn Pocket
	[159] = {"159", "Позолочений ключ", "{{Key}} +1 ключ при підбиранні#{{GoldenChest}} Міняє усі скрині (окрім Старих/Мега) на золоті скрині#{{GoldenChest}} Золоті скрині мають більше предметів ніж звичайно"}, -- Gilded Key
	[160] = {"160", "Щасливий мішечок", "{{GrabBag}} При переході на новий поверх створює 1 мішечок"}, -- Lucky Sack
	[161] = {"161", "Зла корона", "Створює {{TreasureRoom}} Золоту Кімнату і {{Shop}} Магазин у 'Шеолі'"}, -- Wicked Crown
	[162] = {"162", "Обрубок Азазеля", "{{Player7}} 50% перетворитися на Азазеля після зачистки кімнати#Ефект триває поки ви не зачистите і не вийдете з наступної кімнати"}, -- Azazel's Stump
	[163] = {"163", "Какаха", "Усі Діпи (маленькі какахи) тепер не наносять вам шкоди#Створює 1 випадкового Діпа після зачищення кімнати"}, -- Dingle Berry
	[164] = {"164", "Пістон", "{{Bomb}} Створює ще 1 підпалену бомбу поруч з тою, що ви поставили"}, -- Ring Cap
	[165] = {"165", "Ні-і!", "З поверху 'Матка' і далі, заміняє усі монети і ключі на інші випадкові розхідники"}, -- Nuh Uh!
	[166] = {"166", "Пластилін", "50% шанс отримати ефект випадкового пасивного предмета на 1 кімнату"}, -- Modeling Clay
	[167] = {"167", "Полірована кістка", "25% шанс створити дружнього Боні після зачистки кімнати"}, -- Polished Bone
	[168] = {"168", "Порожнє серце", "{{EmptyBoneHeart}} +1 кістяне серце при переході на інший поверх"}, -- Hollow Heart
	[169] = {"169", "Дитячі малюнки", "Поки при вас, враховується як 1 предмет до трансформації 'Гаппі'"}, -- Kid's Drawing
	[170] = {"170", "Кришталевий ключ", "{{Collectible580}} 33% шанс створити прохід у Червоні кімнати після зачистки кімнати#Шанс нижче коли ви вже у Червоній кімнаті"}, -- Crystal Key
	[171] = {"171", "Угода Хранителя", "{{DevilRoom}} 50% шанс, що у Кімнаті Диявола предмети будуть за монети"}, -- Keeper's Bargain
	[172] = {"172", "Проклятий пенні", "{{Coin}} Телепортує персонажа у випадкову кімнату при підбиранні монети#Може телепортувати до Секретної кімнати"}, -- Cursed Penny
	[173] = {"173", "Твій дух", "{{DevilRoom}} Дає можливість узяти один предмет у кімнаті Диявола безкоштовно#Брелок знищиться#!!! Підбирання предмету з кімнати диявола впливає на шанс кімнати Ангела"}, -- Your Soul
	[174] = {"174", "Магніт з цифрами", "{{DevilChance}} +10% до шансу появи кімнати Диявола#Запобігає появи Крампуса у кімнаті Диявола#Дає нові спеціальні варіації кімнат диявола з більшою кількістю ворогів, предметів і чорних сердець"}, -- Number Magnet
	[175] = {"175", "Дивний ключ", "Відкриває прохід до битви з босом 'Хаш'#При використанні {{Collectible297}} ящика Пандори, дає 6 артефактів з випадкового пула предметів"}, -- Strange Key
	[176] = {"176", "Малий згусток", "Створює один кривавий згусток, який повністю повторює рухи і атаки персонажа#{{Damage}} Атаки згустка наносять 35% шкоди персонажа#Компаньйон відроджується після зачищення кімнати, якщо він був убитий"}, -- Lil Clot
	[177] = {"177", "Тимчасове тату", "Створює {{Chest}} скриню після зачистки {{ChallengeRoom}} 'Кімнати Виклику', створює артефакт після зачистки {{BossRushRoom}} 'Бос Рашу'"}, -- Temporary Tattoo
	[178] = {"178", "Проковтнутий M80", "50% шанс вибухнути після отримання шкоди#Працює з ефектами бомб"}, -- Swallowed M80
	[179] = {"179", "Пульт дистанційного керування", "Компаньйони копіюють рухи Ісаака#Тримайте кнопку 'Викинути', щоб компаньйони зупинилися на місці"}, -- RC Remote
	[180] = {"180", "Знайдена душа", "Компаньйон, який слідує за Айзеком і стріляє спектральними сльозами#Копіює ваші характеристики, наносить половину вашої шкоди#Має лише 1 хп#Відроджується кожен поверх"}, -- Found Soul
	[181] = {"181", "Набір розширень", "При активуванні активного артефакту, активує ще 1-2 випадкові активні артефакти"}, -- Expansion Pack
	[182] = {"182", "Сутність Бет", "Створює 5 синіх вогників при вході в {{AngelRoom}} кімнату Ангела#25% шанс створити віспа при пожертвуванні жебракам"}, -- Beth's Essence
	[183] = {"183", "Близнюки", "50% шанс дублювати компаньйонів на 1 кімнату#Якщо немає компаньйонів, створює {{Collectible8}} Братика Боббі або {{Collectible67}} Сестричку Меггі"}, -- The Twins
	[184] = {"184", "Документи про усиновлення", "{{Shop}} Магазини продають компаньйонів за 10 монет"}, -- Adoption Papers
	[185] = {"185", "Нога Крікета", "17% шанс створити випадкову Сарану при вбивстві ворога"}, -- Cricket Leg
	[186] = {"186", "Найкращий друг Аполліона", "{{Collectible706}} Створює 1 Сарану Безодні"}, -- Apollyon's Best Friend
	[187] = {"187", "Розбиті окуляри", "{{TreasureRoom}} 50% шанс створити додатковий невідомий предмет у золотій кімнаті#50% шанс, що таємний предмет у альтернативній золотій кімнаті буде розкритий"}, -- Broken Glasses
	[188] = {"188", "Куб Льоду", "20% шанс паралізувати всіх ворогів у кімнаті#{{Freezing}} Якщо вбити паралізованого ворога, він перетвориться на шматок льоду"}, -- Ice Cube
	[189] = {"189", "Сигіл Бафомета", "Активує щит на 1 секунду після вбивства ворога#Вбивство ворогів дає вам ще 1 секунду щита"}, -- Sigil of Baphomet
}
EID:updateDescriptionsViaTable(repTrinkets, EID.descriptions[languageCode].trinkets)

EID.descriptions[languageCode].goldenTrinket = "Подвоєний ефект!"
EID.descriptions[languageCode].tripledTrinket = "Вау, ефект х3!"
EID.descriptions[languageCode].quadrupledTrinket = "Ого, ефект х4!"

-- Most trinkets that can be doubled or tripled just have the numbers in their description multiplied
-- A few trinkets have odd edge cases where their effect completely changes, or is different depending on if it's Mom's Box or Golden
EID.descriptions[languageCode].goldenTrinketEffects = {
	-- Broken Remote (replace with Teleport 2.0 info)
	[4] = { "{{Collectible419}} Використання активного предмета телепортує персонажа до {{ColorGold}}кімнати, яку ще не було зачищено{{CR}}#Ієрархія: {{Room}}>{{BossRoom}}>{{SuperSecretRoom}}>{{Shop}}>{{TreasureRoom}}>{{SacrificeRoom}}> {{DiceRoom}}>{{Library}}>{{CursedRoom}}>{{MiniBoss}}>{{ChallengeRoom}}{{BossRushRoom}}>{{IsaacsRoom}}{{BarrenRoom}}>{{ArcadeRoom}}>{{ChestRoom}}>{{Planetarium}}>{{SecretRoom}}>{{DevilRoom}}{{AngelRoom}}>{{ErrorRoom}}"}, -- Teleport 2.0
	-- Broken Magnet (find+replace): find Phrase #1 in the localized description, change it to Phrase #2 for doubled
	[6] = { "монетки", "розхідники" },
	-- Rosary Bead (append)
	[7] = { "{{Collectible72}} Вервицю додано до всіх пулів" },
	-- Golden Store Credit: full replace
	[13] = { "{{Shop}} {{ColorGold}}Дозволяє персонажу безкоштовно брати предмети в Магазині{{CR}}#Шанс, що золотий Кредит перетвориться на {{Trinket13}} звичайний після кожної покупки" },
	-- Lucky Rock (append) (Gold / Mom's Box / Both)
	[15] = { "З каменя може випасти 2 монетки", "З каменя може випасти 2 монетки", "З каменя може випасти 3 монетки" },
	-- Golden Mysterious Candy makes Golden Poop (find+replace)
	[25] = { "купку лайна", "золоту купку лайна" },
	-- Isaac's Fork (find+replace): find Phrase #1 in the localized description, change it to Phrase #2 or 3 for doubled/tripled
	[46] = { "половинку серця", "серце", "півтора серця" },
	-- Tick (replace): A full replacement for Golden / Mom's Box / Both, as the Golden version can be removed and only one effect is tripled
	[53] = {
		"-{{ColorGold}}30{{CR}}% здоров'я боса#Відновлює {{ColorGold}}2{{CR}} Червоні серця при вході в {{BossRoom}} Кімнату боса#{{ColorGold}}Знімається!",
		"-{{ColorGold}}30{{CR}}% здоров'я боса#Відновлює {{ColorGold}}2{{CR}} Червоні серця при вході в {{BossRoom}} Кімнату боса#!!! Не може бути знятий#Знімається лише {{Trinket41}} Сірником або може бути проковтнутий",
		"-{{ColorGold}}30{{CR}}% здоров'я боса#Відновлює {{ColorGold}}3{{CR}} Червоні серця при вході в {{BossRoom}} Кімнату боса#{{ColorGold}}Знімається!",
	},
	-- Rainbow Worm (append): With Mom's Box, it gives 2 copies of the temp worm, and doubles 1 of those copies, for triple effect
	[64] = { "Подвоює бонуси Черв'яка до характеристик", "Потроює бонуси Черв'яка до характеристик", "Збільшує в 4 рази бонуси Черв'яка до характеристик", },
	-- Watch Battery (find+replace): find Phrase #1 in the localized description, change it to Phrase #2 or 3 for doubled/tripled
	[72] = { "додатковий 1 заряд", "{{CR}}додаткові {{ColorGold}}2{{CR}} заряди", "{{CR}}додаткові {{ColorGold}}3 {{CR}}заряди" },
	-- Error (append): Same behavior as Rainbow Worm
	[75] = { "Подвоює ефекти брелка, якщо можливо", "Потроює ефекти брелка, якщо можливо", "Збільшує у 4 рази ефекти брелка, якщо можливо", },
	--[[ Karma (find+replace) variation which doesn't work (length? markup characters?)
	[85] = { 
		"{{Heart}} Відновити 1 серце (40%)#{{Coin}} Отримати 1 монету (40%)#{{Luck}} Отримати +1 Удачу (15%)#{{Beggar}} Створити Жебрака (5%)", 
		"{{CR}}{{Heart}} Відновити {{ColorGold}}2 {{CR}}серця (40%)#{{Coin}} Отримати {{ColorGold}}2 {{CR}}монети (40%)#{{Luck}} Отримати {{ColorGold}}+2 {{CR}}Удачі (15%)#{{Beggar}} Створити Жебрака (5%)", 
		"{{CR}}{{Heart}} Відновити {{ColorGold}}3 {{CR}}серця (40%)#{{Coin}} Отримати {{ColorGold}}3 {{CR}}монети (40%)#{{Luck}} Отримати {{ColorGold}}+3 {{CR}}Удачі (15%)#{{Beggar}} Створити Жебрака (5%)", 
	}, 
	]]
	-- Karma
	[85] = { 
		"{{DonationMachine}} При використанні Автомата для Пожертв, з шансом 33%, ви можете:#{{Heart}} Відновити 1 серце (40%)#{{Coin}} Отримати 1 монету (40%)#{{Luck}} Отримати +1 Удачу (15%)#{{Beggar}} Створити Жебрака (5%)", 
		"{{CR}}{{DonationMachine}} При використанні Автомата для Пожертв, з шансом 33%, ви можете:#{{Heart}} Відновити {{ColorGold}}2 {{CR}}серця (40%)#{{Coin}} Отримати {{ColorGold}}2 {{CR}}монети (40%)#{{Luck}} Отримати {{ColorGold}}+2 {{CR}}Удачі (15%)#{{Beggar}} Створити Жебрака (5%)", 
		"{{CR}}{{DonationMachine}} При використанні Автомата для Пожертв, з шансом 33%, ви можете:#{{Heart}} Відновити {{ColorGold}}3 {{CR}}серця (40%)#{{Coin}} Отримати {{ColorGold}}3 {{CR}}монети (40%)#{{Luck}} Отримати {{ColorGold}}+3 {{CR}}Удачі (15%)#{{Beggar}} Створити Жебрака (5%)", 
	}, 
	-- Lil Larva
	[86] = { "з'являється 1 синя муха", "{{CR}}з'являються {{ColorGold}}2 {{CR}}сині мухи", "{{CR}}з'являються {{ColorGold}}3 {{CR}}сині мухи" },
	-- NO! (append)
	[88] = { "Предмети з Якістю {{Quality0}} більше не з'являються" },
	-- Beth's Faith (f+r)
	[142] = { "4 сині вогники", "8 {{CR}}синіх вогників", "8 {{CR}}синіх вогників" },
	-- Mother's Kiss
	[156] = { "+1 контейнер", "+2 {{CR}}контейнери", "+3 {{CR}}контейнери" },
	-- Gilded Key (Golden version only): it doesn't give a key. bug that will get fixed (maybe it'll give a Golden Key?) (replace)
	[159] = { "Замінює всі скрині (окрім Старих/Мега) на Золоті Скрині#Золоті скрині можуть містити додаткові картки, пігулки та брелки" },
	--Lucky Sack
	[160] = { "1 мішечок", "2 {{CR}}мішечки", "3 {{CR}}мішечки" },
	-- Dingle Berry
	[163] = {"1 випадкового Діпа", "2 {{CR}}випадкових Діпів", "3 {{CR}}випадкових Діпів" },
	-- Ring Cap
	[164] = { "1 підпалену бомбу", "2 {{CR}}підпалені бомби", "3 {{CR}}підпалені бомби" },
	-- The Twins (append)
	[183] = { "Може скопіювати/створити 2 компаньйонів", "Може скопіювати/створити 2 компаньйонів", "Може скопіювати/створити 3 компаньйонів" },
	-- Apollyon's Best Friend
	[186] = { "1 Сарану", "2 {{CR}}Сарани", "3 {{CR}}Сарани" },
}

	--[[
	Localizations may choose to overwrite specific data from EID.GoldenTrinketData in this table. For advanced users only.
	Example: If French uses "Double" instead of "2x" for Purple Heart, they can do:
	EID.descriptions[languageCode].goldenTrinketData = {
		[5] = {findReplace = true, mult = 2},
	}
	and then place
		[5] = { "Double", "Quadruple" },
	in their goldenTrinketEffects
	]]

EID.descriptions[languageCode].goldenTrinketData = {
	-- Watch Battery
	[72] = {findReplace = true},
	-- Karma
	[85] = {fullReplace = true}, -- doesn't work with findReplace for some reason (seems like strings are to long for that function, idk)
	-- Lil Larva
	[86] = {findReplace = true},
	-- Beth's Faith
	[142] = {findReplace = true},
	-- Mother's Kiss
	[156] = {findReplace = true},
	--Lucky Sack
	[160] = {findReplace = true},
	-- Dingle Berry
	[163] = {findReplace = true},
	-- Ring Cap
	[164] = {findReplace = true},
	-- Apollyon's Best Friend
	[186] = {findReplace = true},
}


---------- Cards ----------

local repCards={
	[2] = {"2", "I - Чарівник", "Для поточної кімнати: #Самонавідні сльози#↑ {{Range}} +3 Дальність збільшено"}, -- I - The Magician
	[12] = {"12", "XI - Сила", "Для поточної кімнати: #↑ {{Heart}} +1 Контейнер з червоним серцем#↑ {{Damage}} +0.3 Шкоду збільшено#↑ {{Damage}} +50% Шкоди#↑ {{Range}} +5.25 Дальнiсть збільшено#↑ {{Speed}} +0.3 Швидкість збільшено"}, -- XI - Strength
	[16] = {"16", "XV - Диявол", "Для поточної кімнати: #↑ {{Damage}} +2 Шкоду збільшено"},
	[18] = {"18", "XVII - Зірки", "{{TreasureRoom}} Телепортує вас до Скарбниці#{{Planetarium}} Якщо на поверсі є Планетарій, телепортує туди"},
	[27] = {"27", "Трефовий туз", "{{Bomb}} Перетворює всі розхідники, скрині та ворогів, окрім босів, на бомби"}, -- Ace of Clubs
	[28] = {"28", "Бубновий туз", "{{Coin}} Перетворює всі розхідники, скрині та ворогів, окрім босів, на монети"}, -- Ace of Diamonds
	[29] = {"29", "Піковий туз", "{{Key}} Перетворює всі розхідники, скрині та ворогів, окрім босів, на ключі"}, -- Ace of Spades
	[30] = {"30", "Червовий туз", "{{Heart}} Перетворює всі розхідники, скрині та ворогів, окрім босів, на серця"}, -- Ace of Hearts
	[34] = {"34", "Еваз", "Створює люк на наступний поверх#{{LadderRoom}} Створює вхід до криївки, якщо використано на декоративних елементах підлоги (трава, малі камінці, папірці, розсипані коштовності, інше)"},
	[39] = {"39", "Алґіз", "Невразливість на 20 секунд"}, -- Algiz
	[51] = {"51", "Свята картка", "{{HolyMantle}} Одноразовий ефект Святої Мантії#(Блокує першу нанесену шкоду)"}, -- Holy Card
	[52] = {"52", "Гігантський ріст", "Для поточної кімнати: #↑ {{Damage}} +7 Шкоду збільшено#↑ {{Range}} +3 Дальнiсть збільшено#Дозволяє розтоптувати перешкоди на шляху#Розмір збільшено"}, -- Huge Growth
	[54] = {"54", "Епохальна прогулянка", "Для поточної кімнати: #{{Slow}} Сповільнює ворогів#↑ {{Speed}} +0.5 Швидкість збільшено#↓ {{Shotspeed}} -1 Швидкість стрільби знижено"},
	[55] = {"55", "Осколок руни", "{{Rune}} Активує ефект випадкової руни#Ефект осколка слабший, ніж у справжньої руни"}, -- Rune Shard
	[56] = {"56", "0 - Дурень?", "Викидає на підлогу усі ваші серця та розхідники, залишаючи вас з половинкою серця#Монети та бомби можуть бути викинуті як {{Collectible74}}Четвертак або {{Collectible19}}Бум!, якщо можливо"}, -- 0 - The Fool?
	[57] = {"57", "I - Чарівник?", "Аура, що відштовхує ворогів та снаряди, протягом 1 хвилини"}, -- I - The Magician?
	[58] = {"58", "II - Верховна жриця?", "Матусина Нога протягом 1 хвилини б'є по підлозі"}, -- II - The High Priestess?
	[59] = {"59", "III - Імператриця?", "{{Timer}} На 1 хвилину: #↑ {{Heart}} +2 Здоров'я#↑ {{Tears}} +1.35 Темп Стрiльби збільшено#↓ {{Speed}} -0.1 Швидкість знижено"}, -- III - The Empress?
	[60] = {"60", "IV - Імператор?", "Телепортує вас у додаткову кімнату боса з додатковими винагородами#Бос обирається з пулу босів наступних 2 поверхів"}, -- IV - The Emperor?
	[61] = {"61", "V - Первосвященик?", "{{EmptyBoneHeart}} Створює 2 Кісткові серця"}, -- V - The Hierophant?
	[62] = {"62", "VI - Коханці?", "Створює 1 предмет з пулу поточної кімнати#{{BrokenHeart}} Замінює 1 Контейнер Червоного серця чи 2 серця Душі на Розбите серце"}, -- VI - The Lovers?
	[63] = {"63", "VII - Колісниця?", "На 10 секунд перетворює персонажа на невразливу нерухому статую#↑ {{Tears}} Гігантська скорострільність на час ефекту"}, -- VII - The Chariot?
	[64] = {"64", "VIII - Справедливість?", "Створює 2-4 Золоті скрині"}, -- VIII - Justice?
	[65] = {"65", "IX - Відлюдник?", "Перетворює розхідники та предмети в кімнаті на монети відповідно до їх цін у {{Shop}} Магазині"}, -- IX - The Hermit?
	[66] = {"66", "X - Колесо Фортуни?", "Випадковий ефект Кімнати Кубиків"}, -- X - Wheel of Fortune?
	[67] = {"67", "XI - Сила?", "{{Weakness}} Вороги у поточній кімнаті слабші, повільніші та отримують подвійну шкоду#Триває 1 хвилину"}, -- XI - Strength?
	[68] = {"68", "XII - Повішений?", "{{Player14}} Перетворює персонажа на Хранителя на 30 секунд#Потрійний постріл та ↓ {{Speed}} -0.1 Швидкість знижено#З ворогів випадають монети при смерті"}, -- XII - The Hanged Man?
	[69] = {"69", "XIII - Смерть?", "Застосовує ефект {{Collectible545}} Книги Мертвих"}, -- XIII - Death?
	[70] = {"70", "XIV - Терпіння?", "Персонаж ковтає 5 випадкових пігулок"}, -- XIV - Temperance?
	[71] = {"71", "XV - Диявол?", "Застосовує ефект {{Collectible33}} Біблії#Дає політ та {{Collectible390}} Серафима на 30 секунд"}, -- XV - The Devil?
	[72] = {"72", "XVI - Башта?", "Створює 6 скупчень випадкових каменів та перешкод#Високий шанс на появу каменів з мітками"}, -- XVI - The Tower?
	[73] = {"73", "XVII - Зірки?", "Видаляє найстаріший пасивний предмет з інвентарю (ігнорує стартові предмети)#Створює 2 випадкові артефакти з пулу поточної кімнати"}, -- XVII - The Stars?
	[74] = {"74", "XVIII - Місяць?", "{{UltraSecretRoom}} Телепортує вас до Ультра Секретної Кімнати#Створює червоні кімнати для сполучення зі звичайними кімнатами"}, -- XVIII - The Moon?
	[75] = {"75", "XIX - Сонце?", "Для поточної кімнати: #↑ Політ та спектральні сльози#↑ {{Damage}} +1.5 Шкоду збільшено#{{BoneHeart}} Перетворює ваші Червоні серця в Кісткові#Прокляття Темряви"}, -- XIX - The Sun?
	[76] = {"76", "XX - Суд?", "Створює {{RestockMachine}} автомат для поповнення запасів (ресток)"}, -- XX - Judgement?
	[77] = {"77", "XXI - Світ?", "Створює люк до {{LadderRoom}} криївки"}, -- XXI - The World?
	[78] = {"78", "Зламаний Ключ", "{{Collectible580}} Одноразовий Червоний Ключ"}, -- Cracked Key
	[79] = {"79", "Червова королева", "{{Heart}} Створює 1-20 Червоних сердець"}, -- Queen of Hearts
	[80] = {"80", "Дика картка", "Копіює ефект останньої застосованої пігулки/руни/карти/душі чи активного предмета"}, -- Wild Card
	[81] = {"81", "Душа Ісаака", "Реролить предмети в кімнаті#Артефакти на п'єдесталах щосекунди змінюються між оригінальним та новим"}, -- Soul of Isaac
	[82] = {"82", "Душа Магдалени", "Оточує персонажа червоною бульбашковою аурою в поточній кімнаті#{{HalfHeart}} З кожного вбитого ворога випадає половинка червоного серця, яка зникає через 2 секунди"}, -- Soul of Magdalene
	[83] = {"83", "Душа Каїна", "Відкриває всі двері в кімнаті#{{Collectible580}} Відкриває всі можливі проходи до Червоних кімнат з поточної кімнати"}, -- Soul of Cain
	[84] = {"84", "Душа Юди", "Ефект {{Collectible705}} Темних Мистецтв#Перетворює персонажа у фантома, що може проходити крізь ворогів, паралізуючи їх та через кілька секунд наносячи шкоду їм усім"}, -- Soul of Judas
	[85] = {"85", "Душа ???", "{{Poison}} Спочатку персонаж 8 разів випускає хмарки отруйного газу з коричневою рідиною#Потім залишає за собою слід з 7 Дупних Бомб#Поки ви стоїте в рідині: # {{Tears}} +1.5 Темп Стрільби збільшено#↑ {{Damage}} +1 Шкоду збільшено"}, -- Soul of ???
	[86] = {"86", "Душа Єви", "Для поточної кімнати: #Викликає 14 Мертвих Птахів, що атакують ворогів"}, -- Soul of Eve
	[87] = {"87", "Душа Самсона", "Перетворює персонажа в {{Collectible704}} Берсерка з ближньою атакою на 10 секунд#↑ +0.4 Швидкість збільшено#↑ Темп Стрiльби збільшено#↑ +3 Шкоду збільшено#{{Timer}} Кожне вбивство подовжує ефект на 1 секунду"}, -- Soul of Samson
	[88] = {"88", "Душа Азазеля", "Активує {{Collectible441}} Мега Заряд на 7.5 секунд"}, -- Soul of Azazel
	[89] = {"89", "Душа Лазаря", "Персонаж миттєво помирає та воскресає з половинкою серця та тимчасовою невразливістю#Душа автоматично використовується, якщо персонажу завдали смертельного удару (працює як додаткове життя)"}, -- Soul of Lazarus
	[90] = {"90", "Душа Едема", "Реролить предмети та розхідники у поточній кімнаті#Нові предмети обираються з випадкового пулу"}, -- Soul of Eden
	[91] = {"91", "Душа Загубленого", "Персонаж помирає та воскресає за {{Player10}} Загубленого для поточної кімнати#Ви можете взяти 1 предмет в {{DevilRoom}} кімнаті Диявола безкоштовно, але інші зникнуть#Безкоштовний прохід у Мавзолей та Геєну"}, -- Soul of the Lost
	[92] = {"92", "Душа Ліліт", "Створює 1 випадкового компаньйона"}, -- Soul of Lilith
	[93] = {"93", "Душа Хранителя", "{{Coin}} Створює 1-25 випадкових монет"}, -- Soul of the Keeper
	[94] = {"94", "Душа Аполліона", "Створює 15 випадкових Саран"}, -- Soul of Apollyon
	[95] = {"95", "Душа Забутого", "Створює {{Player16}} Загубленого як другого персонажа на 1 кімнату"}, -- Soul of the Forgotten
	[96] = {"96", "Душа Бетані", "Створює 6 вогників {{Collectible584}} Книги Чеснот з випадковими якостями"}, -- Soul of Bethany
	[97] = {"97", "Душа Якова й Ісава", "Створює {{Player20}} Ісава як другого персонажа на 1 кімнату#Він з'являється зі стількома випадковими предметами, скільки є у вашого персонажа"}, -- Soul of Jacob and Esau
}
EID:updateDescriptionsViaTable(repCards, EID.descriptions[languageCode].cards)

-- Card Buffs caused by Tarot Cloth
-- Note: "#" will be replaced with "#{{Collectible451}}" automatically, in order to add Tarot Cloth icon infront of each buff-bulletpoint

EID.descriptions[languageCode].tarotClothBuffs = {
	[2] = "{{Collectible34}} Також активує ефект Книги Беліала", -- I - The Magician
	[3] = "Невдовзі після першого удару, також атакує друга нога", -- II - The High Priestess
	[4] = "Подвоєний бонус до характеристик", -- III - The Empress
	[5] = "Якщо ви ще не перемогли боса, додатково дає вам 1 серце Душі", -- IV - The Emperor
	[6] = "{{SoulHeart}} Створює 3 серця Душі", -- V - The Hierophant
	[7] = "{{Heart}} Створює 3 Червоні серця", -- VI - The Lovers
	[8] = "Подвоєна тривалість", -- VII - The Chariot
	[9] = "Створює вдвічі більше розхідників", -- VIII - Justice
	[10] = "Не дозволяє Жадібності з'явитися в магазині#Перетворює магазин у нормальний, якщо ви вже зустріли там Жадібність", -- IX - The Hermit
	[11] = "Створює 2 Ігрові автомати", -- X - Wheel of Fortune
	[12] = "Подвоєні бонуси до характеристик, окрім множника шкоди", -- XI - Strength
	[14] = "Наносить 80 шкоди", -- XIII - Death
	[15] = "Створює 2 Донорські автомати", -- XIV - Temperance
	[16] = "Подвоєний бонус до шкоди", -- XV - The Devil
	[17] = "Створює 12 троль-бомб", -- XVI - The Tower
	[18] = "Якщо Скарбниця не була відкрита раніше, там буде вибір з 2 предметів", -- XVII - The Stars
	[21] = "Створює 2 Жебраків", -- XX - Judgement
	[56] = "Викидає всі предмети та розхідники з інвентарю, включно з {{Collectible451}} Сукном Таро", -- 0 - The Fool?
	[59] = "↑ {{Heart}} +3 тимчасові Контейнери Червоних сердець", -- III - The Empress?
	[61] = "{{EmptyBoneHeart}} Створює 3 Кісткові серця", -- V - The Hierophant?
	[62] = "{{BrokenHeart}} Додає 2 Розбиті серця та створює 2 предмети", -- VI - The Lovers?
	[64] = "Створює 4-14 Золотих скринь", -- VIII - Justice?
	[65] = "Створює 1 додаткову монету", -- IX - The Hermit?
	[66] = "Застосовує додатковий ефект Кімнати Кубиків", -- X - Wheel of Fortune?
	[68] = "Подвоєна тривалість ефекту", -- XII - The Hanged Man?
	[70] = "{{Pill}} Персонаж ковтає 10 випадкових пігулок", -- XIV - Temperance?
	[72] = "Створює 14 скупчень каменів", -- XVI - The Tower?
	[73] = "Видаляє 2 предмети та створює 4", -- XVII - The Stars?
	[76] = "{{RestockMachine}} Створює 2 автомати для поповнення запасів (рестоки)", -- XX - Judgement?
}

---------- Pills ----------

local repPills={
	[4] = {"3", "Бомби - це ключі", "Кількість бомб та ключів міняються місцями#Золоті бомби та ключі також перемішуються"}, -- Bombs are Key
	[12] = {"11", "Зменшена Дальність", "↓ {{Range}} -0.6 Дальнiсть зменшено"}, -- Range Down
	[13] = {"12", "Підвищена Дальність", "↑ {{Range}} +0.75 Дальнiсть збільшено"}, -- Range Up
	[38] = {"37", "Ретро-погляд", "Графіка стає піксельною на 30 секунд"}, -- Retro Vision
	[42] = {"41", "Я сонний...", "{{Slow}} Сповільнює усіх ворогів та Ісаака в кімнаті"}, -- I'm Drowsy...
	[43] = {"42", "Я збуджений!!", "Прискорює усіх ворогів та Ісаака в кімнаті#Ефект спрацьовує знову через 30 та 60 секунд"}, -- I'm Excited!!!
	[48] = {"47", "Знижена Швидкість Стрільби", "↓ {{Shotspeed}} -0.15 Швидкість Стрільби знижено"}, -- Shot Швидкість Down
	[49] = {"48", "Підвищена Швидкість Стрільби", "↑ {{Shotspeed}} +0.15 Швидкість Стрільби збільшено"}, -- Shot Швидкість збільшено
	[50] = {"49", "Експериментальна пігулка", "↑ Підвищує 1 випадкову характеристику#↓ Зменшує іншу випадкову характеристику#Не зменшує характеристик, якщо є {{Collectible75}}Доктор Наук, {{Collectible46}}Щаслива Ніжка чи {{Collectible303}}Діва#Не збільшує характеристик з {{Collectible654}}Фальшивий Доктор Наук"}, -- Experimental Pill
	[9999] = {"", "Золота пігулка", "Випадковий ефект пігулки#Самознищується через кілька використань"}, -- Golden Pill
}
EID:updateDescriptionsViaTable(repPills, EID.descriptions[languageCode].pills)

EID.descriptions[languageCode].horsepills={
	{"0", "Кепський газ", "{{Poison}} Отруює цілу кімнату"}, -- Bad Gas
	{"1", "Кепський прихід", "Наносить 2 серця шкоди персонажу#Якщо у гравця менше 2 сердець, перетворюється на пігулку 'Повне Здоров'я'"}, -- Bad Trip
	{"2", "Сталеві яйця", "{{SoulHeart}} +4 Серця Душі"}, -- Balls of Steel
	{"3", "Бомби - це ключі", "Кількість бомб та ключів міняються місцями#Збільшує кількість ключів і бомб на 50%#Золоті бомби та ключі також перемішуються"}, -- Bombs are Key
	{"4", "Вибухова діарея", "Під вами з'являється декілька Мега-троль-бомб"}, -- Explosive Diarrhea
	{"5", "Повне Здоров'я", "Повне здоров'я#{{SoulHeart}}+3 Серця Душі"}, -- Full Health
	{"6", "Здоров'я Знижено", "↓ -2 Контейнери червоних сердець"}, -- Health Down
	{"7", "Здоров'я Підвищено", "↑ {{EmptyHeart}}+2 пусті контейнери сердець"}, -- Здоров'я
	{"8", "Я знайшов пігулки", "Немає ефекту"}, -- I Found Pills
	{"9", "Пубертат", "Немає ефекту"}, -- Puberty
	{"10", "Гарненька мушка", "{{Collectible279}} Створює біля персонажа Великого Фаната муху-орбітала#Немає ліміту"}, -- Pretty Fly
	{"11", "Знижена Дальнiсть", "↓ {{Range}} -1.2 Дальнiсть зменшено"}, -- Дальнiсть Down
	{"12", "Підвищена Дальнiсть", "↑ {{Range}} +0.9 Дальнiсть збільшено"}, -- Дальнiсть збільшено
	{"13", "Знижена Швидкість", "↓ {{Speed}} -0.24 Швидкість зменшено"}, -- Швидкість Down
	{"14", "Підвищена Швидкість", "↑ {{Speed}} +0.3 Швидкість збільшено"}, -- Швидкість збільшено
	{"15", "Знижений Темп Стрiльби", "↓ {{Tears}} -0.56 Темп Стрiльби зменшено"}, -- Темп Стрiльби Down
	{"16", "Підвищений Темп Стрiльби", "↑ {{Tears}} +0.70 Темп Стрiльби збільшено"}, -- Темп Стрiльби збільшено
	{"17", "Знижена Удача", "↓ {{Luck}} -2 Удачу зменшено"}, -- Luck Down
	{"18", "Підвищена Удача", "↑ {{Luck}} +2 Удачу збільшено"}, -- Luck збільшено
	{"19", "Теле-пігулки", "Телепортує у випадкову кімнату"}, -- Telepills
	{"20", "48 годин енергії!", "Повністю заряджає ваш активний предмет#{{Battery}} Дає 3-4 батарейки"}, -- 48 Hour Energy!
	{"21", "Гематемезис", "Спустошує всі контейнери червоних сердець, окрім одного#{{Heart}} Створює 4-7 червоних сердець"}, -- Hematemesis
	{"22", "Параліч", "Ви не можете рухатися 4 секунди"}, -- Paralysis
	{"23", "Я бачу Вічність!", "{{SecretRoom}} Відкриває проходи в усі Секретні Кімнати на поверсі#Дає повну карту поверху"}, -- I can see forever!
	{"24", "Феромони", "{{Charm}} Усі вороги у кімнаті - ваші друзі"}, -- Pheromones
	{"25", "Амнезія", "Ховає карту поверху"}, -- Amnesia
	{"26", "Лимонна вечірка", "Під вами з'являється велика калюжа, яка завдає шкоди усім ворогам"}, -- Lemon Party
	{"27", "Ти чарівник?", "Ви стріляєте по діагоналі протягом 60 секунд"}, -- R U a Wizard?
	{"28", "Знеболювальне", "Зменшує всю шкоду персонажу до половинки серця на одну кімнату"}, -- Percs!
	{"29", "Залежність", "Шкода персонажу збільшується до повного серця на одну кімнату#Якщо шкода вже 1 серце, ефекту немає"}, -- Addicted!
	{"30", "Роз-слабся", "Ви какаєте 4 секунди"}, -- Re-Lax
	{"31", "???", "Прокляття 'Лабіринт' на весь поверх"}, -- ???
	{"32", "Ця зробить тебе більшим", "Ви збільшуєтесь#Не впливає на хітбокс"}, -- One makes you larger
	{"33", "Ця зробить тебе меншим", "Ви зменшуєтесь#Ваш хітбокс стає меншим"}, -- One makes you small
	{"34", "Інфікований!", "Створює 2 синіх павуків на кожну купку лайна у кімнаті"}, -- Infested!
	{"35", "Інфікований?", "Створює 2 синіх мух на кожного ворога у кімнаті#Створює 2-6 синіх павуків, якщо в кімнаті нікого немає"}, -- Infested?
	{"36", "Пігулка сили!", "Короткий ефект невразливості#↑ {{Damage}} +7 Шкоду збільшено#↑ {{Range}} +3 Дальнiсть збільшено#Діє на поточну кімнату"}, -- Power Pill!
	{"37", "Ретро-погляд", "Графіка стає піксельною на 90 секунд"}, -- Retro Vision
	{"38", "Друзі до кінця!", "Створює 6 синіх мух"}, -- Friends Till The End!
	{"39", "Проносне", "Під вами з'являється слизька калюжа"}, -- X-Lax
	{"40", "Щось не так...", "Під вами з'являється сповільнююча калюжа"}, -- Something's wrong...
	{"41", "Я сонний...", "Сповільнює всіх ворогів у кімнаті"}, -- I'm Drowsy...
	{"42", "Я збуджений!!", "Прискорює всіх ворогів у кімнаті"}, --I'm Excited!!!
	{"43", "Ковть!", "Знищує всі брелки, що у вас є, і дає їх ефект перманентно#Відновлює 1 Червоне серце за кожен проковтнутий брелок#Ефект не спрацьовує для персонажів без червоних сердець"}, -- Gulp!
	{"44", "Тьху!", "{{Collectible149}} Ваш наступний постріл перетворюється у купу отруйних вибухових снарядів, на зразок 'Іпекаку'"}, -- Horf!
	{"45", "Відчуття, ніби крокую сонячним сяйвом!", "Короткий ефект невразливості#Лякає усіх ворогів#Персонаж наносить 40 контактної шкоди за секунду#Ви відновлюєте половинку серця за кожних 2 вбитих ворогів"}, -- Feels like I'm walking on sunshine!
	{"46", "Вурп!", "Створює останню таблетку, що ви використали"}, -- Vurp!
	{"47", "Знижена Швидкість Стрільби", "↓ {{Shotspeed}} -0.3 Швидкість стрільби знижено"}, -- Shot Швидкість Down
	{"48", "Підвищена Швидкість Стрільби", "↑ {{Shotspeed}} +0.3 Швидкість Стрільби збільшено"}, -- Shot Швидкість збільшено
	{"49", "Експериментальна пігулка", "↑ Двічі підвищує 1 випадкову характеристику#↓ Двічі знижує іншу випадкову характеристику#Не зменшує характеристик, якщо є {{Collectible75}}Доктор Наук, {{Collectible46}}Щаслива Ніжка чи {{Collectible303}}Діва#Не збільшує характеристик з {{Collectible654}}Фальшивий Доктор Наук"}, -- Experimental Pill
	[9999] = {"", "Золота пігулка", "Випадковий ефект пігулки з кінською дозою#Самознищується через кілька використань"}, -- Golden Pill
}

---------- Glitched Item Descriptions ----------

EID.descriptions[languageCode].GlitchedItemText = {
	-- Item Config info
	-- These texts are affected by the PluralizeFunction (ab+ file)
	AddBlackHearts = "{{BlackHeart}} {1} Чорних сердець",
	AddBombs = "{{Bomb}} {1} бомб",
	AddCoins = "{{Coin}} {1} монет",
	AddHearts = "Відновлює {{Heart}} {1} Червоних сердець",
	AddKeys = "{{Key}} {1} ключів",
	AddMaxHearts = "{{EmptyHeart}} {1} Контейнерів Червоних сердець",
	AddSoulHearts = "{{SoulHeart}} {1} сердець Душі",

	-- Cache Flag names
	cacheFlagStart = "Може вливати на ",
	[0] = "{{Damage}} Шкоду", "{{Tears}} Скорострільність", "{{Shotspeed}} Швидкість Стрільби", "{{Range}} Дальність", "{{Speed}} Швидкість", "Ефекти сліз", "Колір сліз", "Політ", "Вид атаки", "Компаньйонів", "{{Luck}} Удачу", "Розмір", "Колір", "Вміст скринь", [16] = "Всі характеристики",

	-- Attribute triggers
	chain = "Тоді:{{CR}} ",
	active = "При використанні:#",
	pickup_collected = "Коли ви піднімаєте розхідник:#",
	enemy_kill = "При вбивстві, шанс на:#",
	damage_taken = "Коли вам завдають шкоди:#",
	entity_spawned = "Коли {T1} з'явився:#",
	tear_fire = "Коли ви стріляєте, шанс на:#",
	enemy_hit = "При попаданні у ворога:#",
	room_clear = "При зачистці кімнати:#",

	-- Attribute effects
	area_damage = "Наносить {1} Шкоди довкола вас",
	add_temporary_effect = "Дає {1} для поточної кімнати",
	convert_entities = "Перетворює усі {1} в кімнаті на {2}",
	use_active_item = "Застосовує {1}",
	spawn_entity = "Створює {1}",
	fart = "Хмарка отруйного газу розміром {1}",

	-- Generic entity names not obtained from entities2.xml
	-- This could also be a place to localize entity names; this table is read from before EID.XMLEntityNames
	["4.-1"] = "підпалена бомба",
	["5.0"] = "розхідник",
	["5.10"] = "Серце",
	["5.20"] = "Монета",
	["5.30"] = "Ключ",
	["5.40"] = "Бомба-розхідник",
	["5.69"] = "Мішечок",
	["5.70"] = "Пігулка",
	["5.90"] = "Батарейка",
	["5.300"] = "Картка",
	["9.-1"] = "ворожий снаряд",
	["999.-1"] = "об'єкт розмітки кімнати",
	["1000.0"] = "ефект",

}

---------- Misc. Text ----------

EID.descriptions[languageCode].poopSpells = {
	{"Лайно", "Звичайне лайно, з якого можна отримати розхідники"},
	{"Кукурудзяне лайно", "Поки ціле, створює синіх мух"},
	{"Палаюче лайно", "Наносить контактну шкоду, поки ціле#Залишає за собою вогонь, коли зруйноване"},
	{"Скам'яніле лайно", "Допоки летить, може 3 рази нанести шкоду#Потрібно постаратися, щоб його зруйнувати"},
	{"Смердюче лайно", "Випускає хмари токсичного газу#{{Warning}} Хмарки вибухають, коли торкаються вогню!"},
	{"Чорне лайно", "Створює сповільнювальну рідину#Наносить 10 шкоди та збиває всіх ворогів з пантелику, коли знищене"},
	{"Святе лайно", "{{Collectible543}} Створює купку білого лайна#Поки персонаж стоїть в аурі лайна:#↑ {{Damage}} +20% Шкоду збільшено#↑ {{Tears}} +150% Скорострільність збільшено#Самонавідні сльози#Шанс блокувати отриману шкоду"},
	{"Коричнева рідина", "Залишає слід з рідини#Допоки персонаж стоїть в цій рідині, його Скорострiльнiсть та Шкода збільшуються#Якщо рідина торкається іншого лайна, вона отримує характеристики тих купок"},
	{"Пердіння", "Відштовхує ворогів та снаряди від персонажа та створює токсичну хмарку#{{Warning}} Хмарки вибухають, коли торкаються вогню!"},
	{"Бомба", "Звичайна метальна бомба"},
	{"Вибухова діарея", "Персонаж швидко створює 5 запалених бомб"},
}

EID.descriptions[languageCode].itemPoolFor = "Пул для предмета:"
EID.descriptions[languageCode].itemPoolNames = {
	[0] = "Скарбниця", "Магазин", "Бос", "Диявол", "Ангел", "Секретка", "Бібліотека", "Наперстки", "Золота скриня", "Червона скриня", "Жебрак", "Демонічний жебрак", "Проклята кімната", "Ключник", "Акумуляторний жебрак", "Матусина скриня", "Скарбниця Жадібності", "Бос Жадібності", "Магазин Жадібності", "Диявол Жадібності", "Ангел Жадібності", "Проклята кімната Жадібності", "Секретка Жадібності", "Crane Game", "Ультра-Секретка", "Бомбезний жебрак", "Планетарій", "Стара скриня", "Дитячий магазин", "Дерев'яна скриня", "Гнилий жебрак",
}

EID.descriptions[languageCode].VoidShopText = "Якщо поглинути зразу після підняття, дає:"
EID.descriptions[languageCode].VoidOptionText = " буде поглинутий натомість"
EID.descriptions[languageCode].VoidNames = {"Швидкість збільшено {{Speed}}", "Темп Стрільби збільшено {{Tears}}", "Шкоду збільшено {{Damage}}", "Дальнiсть збільшено {{Range}}", "Швидкість Стрільби збільшено {{Shotspeed}}", "Удачу збільшено {{Luck}}"}


EID.descriptions[languageCode].spindownError = "Предмет зникає"

EID.descriptions[languageCode].CraftingBagContent = "Сумка:"
EID.descriptions[languageCode].CraftingRoomContent = "Кімната:"
EID.descriptions[languageCode].CraftingFloorContent = "Поверх:"

EID.descriptions[languageCode].CraftingBagQuality = "Якість предмета в Сумці:"
EID.descriptions[languageCode].CraftingBestQuality = "Найкраща Якість:"

EID.descriptions[languageCode].CraftingHideKey = "Сховати:"
EID.descriptions[languageCode].CraftingPreviewKey = "Показати:"

EID.descriptions[languageCode].CraftingResults = "(Гортати: Утримуйте {{CONFIG_BoC_Toggle}} + {{ButtonY}} {{ButtonA}}, Закріпити: {{ButtonX}}, Оновити: {{ButtonB}}, Скинути: Утримуйте {{ButtonRB}})"

EID.descriptions[languageCode].BlankCardCharge = "Заряд Пустої карти:"
EID.descriptions[languageCode].ClearRuneCharge = "Заряд Чистої руни:"
EID.descriptions[languageCode].PlaceboCharge = "Заряд Плацебо:"
EID.descriptions[languageCode].FlipItemToggleInfo = "(Утримуйте {{ButtonSelect}} щоб побачити опис)"


EID.descriptions[languageCode].FalsePHDHeart = "{{BlackHeart}} Створює 1 Чорне серце"
EID.descriptions[languageCode].FalsePHDDamage = "{{Damage}} +0.6 Шкоду збільшено"
EID.descriptions[languageCode].FalsePHDHorseDamage = "{{Damage}} +1.2 Шкоду збільшено"

EID.descriptions[languageCode].PandorasBoxStrangeKeyEffect = "Натомість, поглинає ключ та створює 6 предметів з випадкових пулів"

EID.descriptions[languageCode].AchievementWarningTitle = "{{ColorYellow}}!!! УВАГА !!!"
EID.descriptions[languageCode].AchievementWarningText = "Досягнення вимкнені!#Щоб розблокувати прогрес та досягнення, спочатку вбийте Матусю (Глибини II) без модів.#(Якщо ви вже вбили Матусю, це сповіщення забагалось, просто ігноруйте його)#(Попередження можна вимкнути в конфігу)"

EID.descriptions[languageCode].OldGameVersionWarningText = "Ваша версія Repentance застаріла!#Офіційно підтримується тільки найновіша версія#(Попередження можна вимкнути в конфігу)"

EID.descriptions[languageCode].ModdedRecipesWarningText = "Модифіковані предмети можуть зламати розрахунки рецептів створення!#Використовуйте режим Без Рецептів, якщо ваші рецепти неправильні#(Попередження можна вимкнути в конфігу)"


-- If Debug enabled, add overwrite tables to the languagepack in order for the language completion script to be able to compare them
if EID.enableDebug then
	EID.descriptions[languageCode].repCollectibles = repCollectibles
	EID.descriptions[languageCode].repTrinkets = repTrinkets
	EID.descriptions[languageCode].repCards = repCards
	EID.descriptions[languageCode].repPills = repPills
end
