---------------------------------------
-----  Ukrainian descriptions -----
---------------------------------------

-- Last Sync with English version: 29.11.2024

local languageCode = "uk_ua"

---------- Collectibles ----------

local collectibles = {
	[56] = {"56", "Лимонна невдача", "Створює калюжу рідини#Рідина наносить 24 шкоди в секунду#Калюжа існуватиме, поки ви не покинете кімнату"}, -- Lemon Mishap
	[117] = {"117", "Мертвий птах", "При отриманні персонажем шкоди, з'являється компаньйон-птах#Птах наносить 4.3 контактної шкоди за секунду#Птах залишається, поки у персонажа {{HalfHeart}}1/2 серця"}, -- Dead Bird
	[351] = {"351", "Мега біб", "Наносить 100 шкоди та тимчасово заморожує всіх ворогів в кімнаті#{{Poison}} Додатково наносить 5 шкоди та отруює всіх ворогів поруч#Може відкривати секретні кімнати та ламати перешкоди"}, -- Mega Bean
	[436] = {"436", "Молоко!", "Блокує ворожі снаряди#{{Tears}} Після 10 влучань, розбивається та дає +1.0 до темпу стрільби до кінця поверху"}, -- Milk!
	[447] = {"447", "Довгий біб", "Безперервна стрільба протягом 4 секунд створює хмарку#Розмір хмарки збільшується протягом 10 секунд#Чим більша хмарка, тим менше шкоди вона наносить#Її можна переміщувати, стріляючи в неї"}, -- Linger Bean
	[470] = {"470", "Мовчун", "Літає кімнатою#Наносить 30 контактної шкоди за секунду#Перестає рухатись, коли персонаж стріляє#Поки нерухомий, блокує ворожі снаряди і стріляє в усіх 8 напрямах"}, -- Hushy
	[481] = {"481", "Датамайнер", "↑ Покращує випадкову характеристику#↓ Погіршує випадкову характеристику#{{Timer}} Випадковий ефект сліз для поточної кімнати#Перетворює усі п'єдестали в глючні предмети#{{Blank}} Ламає усі спрайти та музику в кімнаті"}, -- Dataminer
	[510] = {"510", "Несамовитий", "Створює дружню \"несамовиту\" версію боса#Зберігається між кімнатами#{{Warning}} Одночасно може існувати лише 1 бос"}, -- Delirious
	[560] = {"560", "Болить!", "{{Timer}} При отриманні шкоди, персонаж випускає 10 сліз навколо себе#Сльози залишають калюжки рідини при влучанні#↑ {{Tears}} +1.2 до скорострільності при першому ударі#↑ {{Tears}} +0.4 скорострільності при кожному наступному"}, -- It Hurts
	[594] = {"594", "Юпітер", "↑ {{EmptyHeart}} +2 порожні контейнери сердець#↓ {{Speed}} -0.3 до швидкості#{{HealingRed}} Відновлює 2 серця#{{Speed}} Стоячи на місці, персонаж нарощує свою швидкість до +0.5#{{Poison}} Рухаючись, персонаж випускає отруйний газ, а його швидкість зменшується до норми#{{Poison}} Імунітет до отрути"}, -- Jupiter
	[632] = {"632", "Амулет зла", "↑ {{Luck}} +2 до удачі#Імунітет до ефектів{{Burning}} вогню, {{Confusion}} спантеличення, {{Fear}} страху, {{Slow}} павутини та {{Poison}} отрути#Ворожі калюжі не наносять шкоди 1 секунду"}, -- Evil Charm
	[681] = {"681", "Крихітний портал", "Подвійний натиск на кнопки стрільби запускає компаньйона вперед#Наносить конатктну шкоду#Поглинає розхідники на шляху, збільшуючись та створюючи синю муху за кожен#Поглинувши 2-3 розхідники, створює портал в особливу кімнату, яка зберігає свій вміст протягом забігу та може бути використана для перенесення предметів між поверхами"}, -- Lil Portal
	[706] = {"706", "Безодня", "Поглинає усі предмети в кімнаті та створює по сарані за кожен#{{Damage}} Множник шкоди сарани залежить від якості поглинутого премета:#{{Quality0}} - 0.5x#{{Quality1}} - 0.75x#{{Quality2}} - 1.0x#{{Quality3}} - 1.5x#{{Quality4}} - 2.0x"}, -- Abyss
}
EID:updateDescriptionsViaTable(collectibles, EID.descriptions[languageCode].collectibles)

---------- Trinkets ----------

local trinkets = {
	[53] = {"53", "Кліщ", "{{HealingRed}} Відновлює 1 серце при вході в {{BossRoom}} кімнату боса#-15% здоров'я боса#{{Warning}}  Може бути знятий лише {{Trinket41}} Сірником, {{Trinket135}} Запальничкою, або проковтнутий"}, -- Tick
	[97] = {"97", "Мигдалик", "При отриманні персонажем шкоди 6-12 разів, з'являється компаньйон, що блокує ворожі снаряди#До 2 компаньйонів"}, -- Tonsil
	[104] = {"104", "Кістка бажань", "5% шанс створити п'єдестал з артефактом, коли персонажу завдають шкоди#Самознищується після цього"}, -- Wish Bone
	[105] = {"105", "Сумка з обідом", "{{Collectible22}} 5% шанс створити Обід, коли персонажу завдають шкоди#Самознищується після цього"}, -- Bag Lunch
	[133] = {"133", "Вкорочений ґніт", "Бомби вибухають швидше та наносять на 15% більше шкоди"}, -- Short Fuse
}
EID:updateDescriptionsViaTable(trinkets, EID.descriptions[languageCode].trinkets)

---------- Conditions ----------
EID.descriptions[languageCode].ConditionalDescs["5.100.566"] = nil -- Dream Catcher (Greed) - In Rep+, the dream preview works in greed mode as well, so no changes needed


-- If Debug enabled, add overwrite tables to the languagepack in order for the language completion script to be able to compare them
if EID.enableDebug then
	EID.descriptions[languageCode].repPlusCollectibles = collectibles
	EID.descriptions[languageCode].repPlusTrinkets = trinkets
end
